mu	10789
ko	10025
muri	6740
ku	5757
ari	5537
kandi	4952
na	4883
Ntabwo	4837
wa	4712
nka	4440
yuko	4345
uko	4319
n'iki	4181
uwo	4089
ya	3858
nk'uko	3682
gituma?	3404
kuki?	3349
kuri	3340
no	3258
neza	3141
uriya	3106
wambaye	3015
ibi	2998
ngo	2903
igihe	2836
Umugabo	2821
cyane	2782
ikintu	2718
icyo	2715
gukora	2668
yo	2594
yari	2483
we	2482
ibyo	2428
ntabwo	2409
ni	2354
hari	2354
iki	2325
Mariya	2195
kugira	2164
i	2127
kuba	2099
hamwe	2085
niba	2036
ariko	1885
afite	1815
mugihe	1734
ye	1723
cyo	1666
kugirango	1666
akazi	1635
ufite	1620
abantu	1495
umurimo	1491
arimo	1483
Niba	1441
muto	1424
iyo	1400
byose	1396
Umugore	1373
uyu	1365
iyi	1349
Ndashaka	1340
ahubwo	1320
gusa	1320
aho	1314
umuntu	1312
hejuru	1307
gu	1289
babiri	1266
byukusenge	1265
mbere	1258
gihe	1234
kubera	1206
imbere	1200
umwanya	1158
ndetse	1147
ishati	1145
bwo	1130
kuvuga	1126
etc.	1113
nta	1078
Nzi	1067
hafi	1066
ibintu	1063
cye	1050
inyuma	1049
inama	1047
kubona	1042
Abantu	1039
impamvu	1036
ushobora	1030
kumenya	1022
-ri	1001
kumera	991
avuga	991
kugeza	985
karasira	975
Ntekereza	974
wo	974
yavuze	960
buryo	940
cya	906
cyangwa	897
Natekereje	883
nshobora	881
rwe	879
kubumba	876
hano	870
nyina	870
uburyo	856
kumva	856
nzi	849
wabo	837
nyuma	835
u	820
Imana	816
bari	808
munsi	799
aha	799
ubu	790
Kuki	767
ntekereza	763
amafaranga	752
atari	746
Ni	744
bye	732
cyane.	731
ubwoba	725
Tom	723
azi	723
Mfite	722
Sinshaka	720
ibiri	718
buri	717
byongeye	715
agomba	715
kujya	707
ushaka	706
rwose	703
uri	702
umugore	697
Sinzi	695
nyamara	694
kumwe	694
umuhungu	693
Nta	693
Kubera	684
nshaka	679
gufata	677
gutera	675
gutuma	673
kuko	672
Nizere	670
yera	669
ubusa	667
yicaye	666
kimwe	659
byo	657
Utekereza	655
Sinshobora	653
byiza	649
ashobora	641
yumukara	640
maze	638
gukabya	638
Urashaka	637
benshi	633
ugomba	631
Hariho	628
rimwe	626
yose	620
bo	619
amambu	616
-inshi	614
bose	607
bambaye	606
eye	606
ntashobora	596
Nkusi	596
neza.	596
kwa	591
Umukobwa	586
a-	584
adashaka	581
wanjye	571
ikibazo	570
Ugomba	570
we.	569
Imbwa	568
imyenda	566
umwana	565
ndimbati	564
umugabo	561
Mu	557
saa	556
kintu	554
kugenda	552
yubururu	552
tugomba	550
be	548
Pawulo	547
hanze	546
cyose	546
kurya	536
umwe	534
ahagaze	532
byari	528
Umuhungu	526
guterana	518
kwigera	517
bene	517
Nari	513
ze	512
nawe	510
akora	507
byambo	506
nyirasenge	499
ukuntu	496
ngomba	496
bicaye	493
mwiza	491
iri	490
-iza	490
umusatsi	486
Iyo	486
Kristo	485
afashe	485
wenyine	485
ubwo	484
mfite	483
bwe	482
ashaka	479
kugera	478
kugena	476
ukora	475
yumva	474
munsi.	474
kuva	472
byinshi	472
bafite	471
bavuga	469
Umwana	469
numva	468
bamwe	465
isi	463
hano.	462
yambaye	461
Birashoboka	459
rya	457
ukiri	453
imyaka	452
vuba	452
ngombwa	451
gukunda	450
Abagabo	449
ishuri	449
Ibi	448
Byambo	447
uzi	445
yanjye	445
Ndatekereza	444
yabo	439
yijimye	436
Umuntu	431
birashoboka	430
se	429
itukura	428
kubi	425
ukuri	423
iruhande	423
umupira	423
menshi	422
rero	418
kinini	417
n	416
kugura	415
barimo	413
Uratekereza	413
Tugomba	412
kureba	411
bya	410
bwa	407
abana	406
inshuti	398
kwiga	395
Hari	395
ejo	392
abandi	392
murugo	390
ubuzima	388
yashakaga	387
imwe	386
ibibazo	385
hanyuma	384
gukeka	383
gutekereza	383
Itsinda	383
yabwiye	382
amaze	382
amahirwe	381
nari	381
akunda	380
nkaho	379
zo	378
ifite	378
za	371
wese	371
cyilima	368
kwizera	367
yambwiye	366
hagati	365
a	363
ingofero	363
ba	362
bahagaze	361
nini	361
muntu	359
bimwe	358
ibya	358
si	357
hasi	356
abo	348
Igihe	346
Muri	344
nuko	344
Ndimbati	343
Nubwo	342
areba	341
undi	339
inzu	338
udashaka	338
bishoboka	334
imodoka	334
ahantu	332
dushobora	330
wawe	329
bagenda	329
intego	329
wari	329
ntebe	328
nkuko	327
bato	326
gukora.	326
kuruta	325
ntacyo	323
Ndakeka	322
U	322
kubaho	319
-te?	316
nubwo	313
rwa	313
nziza	313
Umusore	312
kuburyo	311
Ibyo	308
batatu	308
mbona	306
kuvugana	305
bareba	304
wenyine.	304
Nshobora	304
kazi	303
kurangiza	303
mugabo	303
umukobwa	302
bigaragara	301
mpamvu	300
gitabo	299
yawe	297
Uzi	295
ebyiri	295
gushaka	295
Ndumva	295
Abana	294
numugore	293
gahunda	293
Hano	293
Yavuze	291
ikoti	291
umunsi	290
kubikora	289
wijimye	289
gito	289
Rwanda	288
igare	287
imbwa	286
gusohoka	285
moshi	284
byose.	284
kumuhanda	282
Ikibazo	282
ikindi	282
kwambara	281
ijambo	281
bwiza	280
Icyo	279
ubutumwa	279
amaboko	279
gato	277
igitekerezo	277
ibishoboka	276
mbere.	275
yumvise	274
umukoro	274
iminsi	274
yukora	274
ibyerekeye	273
Iyi	271
wara	271
gari	271
gukoresha	270
ye.	270
Ntugomba	270
rye	269
cyiza	268
Mariya.	267
utekereza	267
kare	266
asa	266
gusa.	265
Kandi	264
bityo	263
mucanga	262
imbaraga	261
kirekire	261
nkara	260
aba	260
Numvise	259
nyinshi	259
igituma	257
kunywa	256
ibitekerezo	256
Nkeneye	255
amazi	255
-gamije	254
(no	254
nkunda	254
Uyu	254
bugufi	253
gituma?ra	253
nk'ukora	253
anet	252
ndashaka	251
yagiye	250
ikiganiro	250
agenda	249
gusohora	249
kuza	249
-nyine	249
gukina	247
gufungura	246
bagomba	246
yacu	245
kingana	245
ubugenere	245
yashoboraga	244
sinzi	242
rwo	242
mugenzi	241
sinshobora	241
Ikintu	241
isaha	240
Ndizera	239
uwora	239
gitari	239
gusoma	238
inshingano	236
nzu	235
meza	235
bishobora	235
mama	235
kabiri	235
guhinguka	235
imirimo	235
mwana	235
kuki?ra	234
kubaza	232
kenshi	232
ifoto	231
gihe.	231
kuguma	231
Abagore	230
ubufasha	230
kuriyi	230
gusanga	229
zose	229
aya	228
ngiye	228
ryabantu	227
gutsinda	226
yaba	225
wose	225
sibyo?	223
ibi.	223
ababyeyi	222
guhora	221
kibazo	220
muriyi	220
wicaye	219
izina	219
ahagarara	218
yakoze	218
nawe.	217
kureka	216
Sinari	216
yagombaga	216
bintu	215
Ntushobora	215
kwe	215
rugo	215
nkwiye	215
gutanga	214
gitondo.	214
ahagije	214
Kalisa	213
ntiyigeze	213
kirere	212
runaka.	212
gutembera	212
kure	211
shebuja	210
kubwira	210
bakora	210
murumuna	210
ibiryo	209
adafite	208
yaretse	208
Bavuga	207
azaba	207
bantu	206
akamaro	206
adashobora	206
Umubyeyi	205
iteka	205
Rukara	205
aryamye	204
umugambi	203
cyumweru	202
-zi	202
mirongo	201
Urashobora	200
cyanjye	200
abona	199
abagabo	199
ejo.	199
mukuru	198
Ngomba	198
Bwana	197
bashaka	197
nkeneye	197
kwerekana	196
nabi	196
akeneye	196
igisubizo	196
kurya.	195
ikabutura	195
kubana	195
nifuza	195
agira	194
ryari	194
yumuhondo	193
dufite	193
inzira	192
Boston	192
Reka	192
umugongo	191
atazi	191
turi	189
zimwe	189
muryango	189
nshya	189
gukomeza	189
koga	188
ubushobozi	188
bategereje	188
yanjye.	188
kwishyura	188
John	187
Byari	187
Nifuzaga	186
ifunguro	186
ubwoya	185
nzashobora	185
akazi.	184
mumuhanda	184
udashobora	184
ubu.	184
inota	184
buzima	183
kongera	183
hirwa	182
gusobanukirwa	182
kera	181
bazi	181
umukambwe	181
amagambo	180
kibi	180
numugabo	180
yicyatsi	179
nkora	178
terefone	178
murimo	178
amakuru	176
mwiza.	176
gutanglra	176
wumuhondo	175
baseball	175
byagenda	174
guhamya	174
bwe.	174
kuwa	174
impiya	173
umukecuru	173
gusumira	173
umuryango	172
imvura	172
ntazi	172
gihugu	172
ajya	172
yahisemo	171
iduka	171
arashaka	171
gitondo	170
kugenda.	170
Yesu	170
Ku	170
amakosa	170
giti	169
kumeza	169
umu	169
iryo	169
wifuza	169
guhura	168
ntashaka	167
ntoki	166
runaka	166
orange	165
gutaha	165
mugore	165
Buri	164
uhagaze	164
Iki	164
ntiyashoboraga	164
gutegereza	163
afata	163
ino	163
cyose.	163
yose.	163
yagerageje	163
igorofa	163
ndi	162
Aziya	162
ati:	161
kibazo.	161
atashakaga	161
muremure	161
natwe	161
mushiki	161
kubikora.	160
minsi	160
modoka	160
pe	160
gusaba	160
igitabo	159
ifeza	159
amenya	159
buriri	159
ufashe	159
gutya	159
meze	158
bigomba	158
hantu	158
mwaka	158
icumi	158
Nakubwiye	157
maso	157
mujyi	157
aza	157
amaso	157
ubutaka	157
wumva	157
kwemera	157
bagenzi	156
Chris	156
yaje	156
yagize	156
ubwenge	156
koko	156
kwita	156
guhaha	155
umutwe	155
amasaha	155
agiye	154
gito.	154
Nigute	154
kamera	154
ubudahwema	153
ukwezi	153
izi	153
none	153
hagira	153
impano	152
harimo	152
ukubera	152
munini	151
Avuga	151
kibisi	151
inshuro	151
kugerageza	151
gufasha	151
ubona	150
mwarimu	150
kumurongo	150
uvuga	149
ba-	149
gusubiza	149
itabi	148
yuzuye	148
ubuhamya	148
bombi	148
azaza	148
parike	148
urimo	147
kubaho.	147
yinzu	147
icyemezo	147
yinyubako	147
Nabwiye	147
ukwiye	146
njye	146
nanjye	146
Nyuma	146
cyumba	145
ho	145
tennis	145
Nkunda	145
abwira	144
Simoni	144
Sinigeze	144
gutinya	144
be.	144
akana	144
guhamiriza	143
idirishya	143
Hagomba	143
bidatinze	143
umumaro	143
ryo	143
gukurikiza	142
atameze	142
cumi	142
kuglra	142
kwaka	142
yigeze	142
nu	142
ikirere	141
ukunda	141
kubyo	141
Sinifuzaga	140
mubirori	140
kigiye	140
umutima	140
ava	139
byimazeyo	139
gusura	139
ururimi	139
kwibuka	139
izuba	138
ikintu.	138
ke	138
rwose.	138
Ntago	138
ibikoresho	137
kwiburanya	137
nko	137
guta	137
burya	136
mucyumba	136
hano?	136
gusubira	136
Sinumva	136
aka	136
yifuzaga	135
asaba	135
kujyana	135
atagomba	135
Beth	135
wowe	135
ameze.	135
.	134
aricyo	134
Nyamuneka	134
yahaye	134
sebukwe	134
guha	134
ukora.	134
bwose	134
bibi	133
ibyiringiro	133
du	133
kwemeza	133
Yari	133
inama.	133
utukura	133
nzira	132
irimo	132
n'ingofero	132
bye.	132
amafaranga.	132
bivuze	132
n'umweru	132
ibyo.	131
Turashaka	131
nkicyo.	131
nishati	131
ikizamini	131
icyifuzo	131
ijuru	131
data	131
Eric	131
nkibi	131
nemera	130
urugendo	130
resitora	130
nyamuneka	130
bifite	130
Mama	130
atashoboraga	130
bihagije	129
dukwiye	129
kirori	129
Ubu	129
byabaye	129
yu	129
umutekano	129
kunywa.	129
Nizera	129
kumbwira	129
umukunzi	129
sinshaka	129
kuruhande	128
Abahungu	128
uruhare	128
agaciro	128
ubwoba.	128
kubengerana	127
ureba	127
bihe	127
guhindura	127
uru	127
y'amazi	127
udafite	127
bumva	126
nabandi	126
imbabazi	126
ageze	126
Yohana	126
Itorero	126
naho	126
kwihanganira	126
wavuze	126
ufata	125
rusange	125
gishobora	125
ishuri.	125
kubura	125
urugero	124
ishyaka	124
kumurika	124
Mubwire	124
bibaho	124
hirya	123
urukundo	123
kubyerekeye	123
nyirabukwe	123
indwara	123
bumwe	123
Wigeze	123
agerageza	122
akiri	122
Ntacyo	122
mumazi	122
bisi	121
ati	121
nigeze	121
nabana	121
kuringanira	121
myaka	121
bakina	121
hariho	120
igice	120
ako	120
ntagomba	120
gutegeka	120
nagombaga	120
ayo	120
bwawe	120
yifuza	120
Rimwe	119
mubi	119
kwiyiriza	119
Bamwe	119
guhamagara	119
ishusho	118
bwato	118
kuzana	118
byawe	118
niteze	118
ishaje	118
icyongereza	118
kujyayo	118
nizera	117
dukora	117
bizaba	117
atigeze	117
baba	117
kuruzi	117
atekereza	117
bagiye	116
mazi	116
ubundi	116
bane	116
sinigeze	116
Bifata	116
yanze	116
Ushobora	116
imwe.	116
muganga	116
bishoboka.	116
kumunsi	115
babo	115
avugana	115
kwigomwa	115
Gusa	115
umwenda	115
Abakobwa	114
igikorwa	114
yakora	114
cyawe	114
nama	114
kazi.	114
gusangira	114
igomba	114
ukomeye	113
guheruka	113
kaminuza	113
imyitozo	113
imbuto	113
ukeneye	113
ubukwerere	113
wacu	113
murigabo	113
yitegereza	113
uhagije	113
biro	113
habaye	113
Data	113
ze.	113
guturuka	113
kukubwira	113
ikiganza	113
murugo.	113
bakunda	113
ihagaze	113
inkuru	112
kwicara	112
bikorwa	112
muka	112
Biragoye	112
acuranga	112
utaha.	112
ingoma	111
gutwara	111
itatu	111
yamenye	111
uza	111
bimeze	111
umuyobozi	110
utagomba	110
gusiga	110
make	110
njya	110
ryijimye	110
umuganga	110
ndatekereza	110
gukorera	110
muhanda	110
nziza.	110
sita.	110
muburyo	110
Ngiye	110
yerekana	109
yemera	109
Uwiteka	109
kimwe.	109
kubyuka	109
?	109
Noneho	109
y'umukara	109
ahora	109
bizagenda	109
Ndibaza	109
mudasobwa	109
Yerusalemu	108
ntago	108
yashoboye	108
umunwa	108
guhingutsa	108
Ariko	108
vub'aha	108
kwinjira	108
vuba.	108
Birasa	107
guuriyara	107
ugiye	107
ibirori	107
Ntutekereza	107
urashaka	107
gusebwa	107
ndumva	107
natwe.	107
icyumba	107
cye.	107
ibihe	107
numuntu	107
Wari	106
gato.	106
hino	106
Kenny	106
igitambaro	106
uburenganzira	106
Dutekereza	106
ibyiyumvo	106
Ufite	106
musore	106
ningoga	105
yitwaje	105
bi	105
joro.	105
wanjye.	105
mikoro	105
kose	105
dore	105
ishobora	105
kindi	105
w’Imana	105
Biragaragara	105
ntiyashakaga	104
izo	104
zabo	104
iki?	104
vubaha	104
ameze	104
ikote	104
yaguze	104
Nkuko	104
atamukunda.	104
gucuranga	104
rye.	104
kuvuga.	104
aramutse	103
umwami	103
tudashobora	103
ka	103
yerekeza	103
numwe	103
-zima	103
kuba.	103
umukino	103
amaherezo	103
kanwa	103
bwite	103
ujya	102
gukemura	102
niki	102
bakeneye	102
sinkeka	102
bitarenze	102
Bwira	102
umutaka	102
Kuva	102
udashaka.	102
kugenzura	101
byoroshye	101
akaba	101
yawe.	101
ibitabo	101
nibyo	101
noneho	101
kavukire	101
kumubaza	101
imibereho	101
n'umugore	101
ntazashobora	101
Abasore	100
yacu.	100
mirimo	100
gituma?ra.	100
dukeneye	100
mubuzima	100
yabonye	100
kaga	100
asoma	100
habaho	100
yatekerezaga	99
twese	99
yukora.	99
numvise	99
atazashobora	99
yanga	98
Umusaza	98
bizatinda	98
wawe.	98
n'ingoga	98
gicamunsi.	98
indi	98
ntakintu	98
yiruka	98
igikapu	98
Ndasaba	98
gifite	97
aririmba	97
ukuri.	97
ukuboko	97
yasabye	97
Kuba	97
zahabu	97
neza?	97
umushinga	97
hakiri	97
uretse	97
amahoro	96
ntari	96
mwanya	96
bwangu	96
ubucuruzi	96
Ntidushobora	96
imyanda	96
ubwoko	96
magambo	96
yafashe	96
bitazongera	96
Sinkunda	96
swater	96
amadarubindi	95
azashobora	95
amatwi	95
uku	95
arwaye,	95
amwenyura	95
kwiyumvisha	95
bwabo	95
kwifuza	95
bibiri	95
Bizatwara	95
biri	95
ikipe	95
ariwe	95
metero	94
imyigire	94
ubutwari	94
isoko	94
waba	94
nabantu	94
ubushake	94
kamere	94
kubintu	94
ugira	94
wara.	93
ipantaro	93
ukundi.	93
gupfa	93
bigoye	93
jans	93
batekereza	93
Ese	93
utari	93
Dufite	93
abagore	93
Muganga	93
gukorana	93
muhungu	93
umuhanga	93
ndende	93
ibi?	92
hose	92
bashobora	92
avuga.	92
azatsinda	92
namusabye	92
kurenza	92
tank	92
keretse	92
amashusho	92
Boston?	92
nyuma.	92
twari	92
kiri	92
mubyukuri	91
Yumvaga	91
nto	91
intege	91
impungenge	91
gusobanura	91
Ababyeyi	91
kurukuta	91
guhagarika	91
yabuze	91
ntaho	91
numuhungu	91
ahari	90
ikositimu	90
nkuru	90
nza	90
nonaha.	90
azakora	90
bwanjye	90
Ntiwibagirwe	90
akina	90
bisa	90
nijoro	90
Nzaba	90
Uwo	90
wabo.	90
kuganira	90
uwora.	89
kubaka	89
kuvoma	89
firime	89
Ntugire	89
sita	89
abaturage	89
Satani	89
izaba	89
kuki	89
ibimenyetso	89
Waba	89
Nabonye	89
abone	88
umukire	88
Kugeza	88
akavuga	88
numukobwa	88
bana	88
umwaka	88
wubururu	88
igikombe	88
gukomera	88
utazi	88
bake	88
akenshi	87
ibara	87
kumufasha	87
byatsi	87
ashyira	87
ubufasha.	87
yatekereje	87
umuriro	87
Nzareba	87
bituma	87
yabo.	87
Umuryango	87
umuhanda	86
mbiri	86
numwana	86
niyo	86
ariuriya	86
uzaba	86
kumi	86
ngingo	86
inguzanyo	86
ubutunzi	86
barashobora	86
bwiza.	86
barya	86
so	86
n’Imana	86
mvuga	86
afasha	86
Nibyiza	86
zawe	85
ryose	85
rubura	85
ntazongera	85
usa	85
tuzashobora	85
ugenda	85
Mwuka	85
Umwarimu	85
kubika	85
umubiri	84
cyatumye	84
Umutegarugori	84
abanyeshuri	84
ijoro	84
ibyiza	84
televiziyo	84
Perezida	84
wumukara	84
gushidikanya	84
rinini	84
imiti	84
y	84
mukobwa	84
Gashuhe	83
ambwira	83
biza	83
byinshi.	83
ntambara	83
nkombe	83
uhereye	83
gushyira	83
kwica	82
umwanzuro	82
babonye	82
umususu	82
guhangayikishwa	82
menya	82
nyinshi.	82
Niki	82
nashoboraga	82
bikomeye	82
nibwo	82
kwezi	82
gusobanurira	82
murongo	82
gukorwa	81
kudufasha	81
bwacu	81
kumara	81
ituma	81
nabonye	81
nshya.	81
igitaka	81
kwiruka	81
keza	81
kwandika	81
yenda	81
inyama	80
nk’uko	80
abizera	80
amata	80
Ari	80
Museveni	80
cyiza.	80
yiyahuye.	80
impanuka	80
kimeze	80
Nuko	80
zirenze	80
ukuze	80
mwe	80
bitandukanye	79
gikomeye	79
Nyamara	79
Bill	79
rutare	79
guhagarara	79
nzaba	79
gatandatu	79
Si	79
Nashakaga	79
uruhushya	79
nshoboye	79
inyungu	79
mbone	78
yumutuku	78
n’umugore	78
bawe	78
urunigi	78
bwari	78
kugaragara	78
ikibazo.	78
uramutse	78
gusohoza	78
ugeze	78
isura	78
bitaro	78
Nishimiye	78
ndimo	78
mwebwe	78
ubumenyi	78
n'umukunzi	78
gufotora	78
mutwe	78
kibuga	78
nipantaro	77
birori	77
bike	77
yiteguye	77
sinari	77
bukeye	77
nabo	77
gute	77
umwuka	77
guhisha	77
atwara	77
isi.	77
tuzi	77
atanga	77
cyubupfu.	77
kuki?ra.	76
abavuga	76
ibihuha	76
yampaye	76
nimugoroba	76
bavuze	76
yumvaga	76
mugitondo	76
gusuzuma	76
kangahe	76
Nzakora	76
Ntashaka	75
idini	75
umenya	75
wundi	75
biragaragara	75
kuringaniza	75
Abakozi	75
amaraso	75
ububasha	75
Sinatekerezaga	75
umugozi	74
ntigeze	74
irangi	74
picnic	74
ashoboye	74
n'ebyiri	74
nkara.	74
igicucu	74
Ntibikenewe	74
Umunsi	74
byaba	74
ukuvuga	74
bizatwara	74
kurongora	74
ama	74
kirekire.	74
mpari	74
umaze	74
ukina	74
banjye	74
nkibyo	74
gutangira	74
umurongo	74
yakoraga	74
ntibari	74
rimwe.	74
papa	74
siporo	74
wange	74
bifuza	73
ninshuti	73
icyubahiro	73
nimbwa	73
udakunda	73
batari	73
nk'ukora.	73
igiciro	73
njye.	73
ushize.	73
isoni	73
muti	73
hashize	73
Nibyo	73
yakomeje	73
umwanditsi	72
aha.	72
yanditse	72
karuvati	72
ashobore	72
inyigisho	72
inkumi	72
hoteri	72
Wabwirwa	72
nabi.	72
abakinnyi	72
irenga	72
nku	72
kubyara	72
mubwira	72
biro.	72
tugiye	72
ategereje	72
namwe	71
wikendi.	71
murima	71
mugisha	71
Ubwo	71
kurinda	71
zifite	71
nkuyu	71
Kizito	71
ntugomba	71
ategereza	71
Nkusi.	71
bahora	71
inyandiko	71
rwego	71
gare	71
kabari	71
yishimye	71
ye,	70
kubasha	70
kaminuza.	70
bitwara	70
Kugira	70
Buyapani	70
eshatu	70
cyari	70
baje	70
makumyabiri	70
umuziki	70
yashaka	70
umerewe	70
Long	70
gi	70
kwigisha	70
t-shirt	70
ibitagenda	70
rwe.	70
Umukinnyi	70
atera	70
adahari	70
ashishikajwe	70
ibanga	70
b	70
Ntakintu	70
Turizera	70
mumujyi	70
Mubera	69
indirimbo	69
arwaye	69
ndamutse	69
ntishyuye	69
g	69
joro	69
amajwi	69
zikomeye	69
icyapa	69
bushya	69
Mugihe	69
mubyo	69
iminota	69
rutugu	69
kuyobora	69
kwitabira	69
kwihugura	69
ukwizera	69
Turimo	69
atatekerezaga	69
gusukura	69
guhwema	69
wenyine?	69
kumvikana	69
amasezerano	68
icyumweru	68
nkibyo.	68
indabyo	68
wamazi	68
gatatu	68
atumva	68
Kuri	68
kwishima	68
uzabona	68
kivuga	68
abiri	68
kayira	68
yatumye	68
namenye	68
kugwa	68
agura	68
tujye	68
icupa	68
mumagare	68
bateraniye	68
jambo	68
numuryango	68
munzira	67
nakubwiye	67
urupfu	67
guhaba	67
umukara	67
gisirikare.	67
imibonano	67
ndebe	67
cyabo	67
mike	67
ingaruka	67
iburyo	67
ry’Imana	67
mumaso	67
igihugu	67
ntiyari	67
yifotoza	66
kiyaga	66
yumwana	66
Umwami	66
shobuja	66
nzagaruka	66
mumodoka	66
bitaro.	66
ugere	66
ivuga	66
kuguha	66
yamaze	66
Boston.	66
inkweto	66
imisozi	66
kubyina	66
sitasiyo	66
areka	66
ejo?	66
atazaba	66
uzashobora	66
umuco	66
mumurima	66
kuhagira	66
niko	66
akoresheje	66
iba	65
itari	65
yatubwiye	65
nzagira	65
urukurikirane	65
amwe	65
birenge	65
bikwiye	65
bigiye	65
k	65
yinjiye	65
kwibiza	65
arenga	65
ubururu	65
ikora	65
nashoboye	65
zanjye	65
kalisa	65
murigore	65
divayi	65
usibye	65
cyane,	65
kuzirikana	65
kare.	65
ubungubu	65
yashyize	65
giteye	65
mwishuri	65
mbere,	64
Mbabajwe	64
mwene	64
kuzinduka	64
ubi	64
gice	64
intambara	64
gutya.	64
urubanza	64
utagira	64
yawe?	64
dusubira	64
mushya	64
ntazemera	64
kumutwe	64
avuye	64
wiga	64
umwanda	64
agera	64
itsinda	64
Nagerageje	63
wagombaga	63
yahuye	63
ryera	63
icyongereza.	63
badashaka	63
ibirenge	63
kuryama	63
mbi	63
gikoni	63
mategeko	63
bwira	63
buto	63
umusore	63
tudafite	63
ryanjye	63
yatsindiye	63
ntibyari	63
igikinisho	63
Kagame	63
yamugiriye	63
minsi.	63
ibibazo.	63
Wavuze	63
cyanjye.	63
Amerika	63
mwuga	63
Ntashobora	63
amanota	63
bemera	62
itatu.	62
ubwe	62
umubwire	62
ntibashobora	62
urashobora	62
byeri	62
byerekana	62
byagenze	62
Tom.	62
Yababwiye	62
niho	62
kohereza	62
bizashoboka	62
kelly	62
binyuze	62
yumuhanda	62
adashaka.	62
ngufasha	62
nijoro.	62
nyoko	62
gusenga	62
batanu	62
reka	62
biteye	62
rukundo	61
Ahari	61
mfata	61
bageze	61
itegeko	61
imiterere	61
umusozi	61
kurira	61
yundi	61
he	61
Se	61
hashobora	61
Ndabona	61
nanjye.	61
myiza	61
ruhande	61
bafata	61
kumurimo	61
ibyumweru	61
yamubwiye	61
igifaransa	61
nabagenzi	61
nkicyo?	61
icyatsi	61
bikaba	61
akorera	60
pacy	60
inda	60
itanu	60
n’uko	60
kubyumva	60
yaka	60
yakoze.	60
mura	60
kurwanya	60
amashati	60
Mike	60
bitari	60
rwanjye	60
pisine	60
n’umuryango	60
gikapu	60
umwanzi	60
kaburimbo	60
intumwa	60
yimodoka	60
kukubona	59
matayo	59
inkoni	59
kidasanzwe	59
saha	59
ntamuntu	59
polisi	59
nama.	59
kumusozi	59
kanya.	59
mbwa	59
Ejo	59
ifarashi	59
bizageza	59
bajya	59
Natangajwe	59
wumunyamerika	59
yesu	59
kurekeraho	59
kamali	59
Aho	59
maremare	59
Leta	59
nizere	59
ari.	59
Afite	59
ntoya	59
arashobora	59
ngira	59
nibura	59
ubwa	59
gatanu	59
byukuri	59
Reba	59
yinyanja	58
bagera	58
urugo	58
amajipo	58
asohoka	58
uba	58
bazashyingirwa	58
cyawe.	58
neza,	58
yanduye	58
igendanwa	58
Kigeme	58
Mugabe	58
intwari	58
kizaba	58
ubwanwa	58
-biri	58
Iri	58
yandakariye	58
igihe.	58
badakunda	58
miliyoni	58
biba	58
guca	58
wigeze	58
ahuze	58
y’aho	58
gukora?	57
ibiro	57
Abashakanye	57
kundi	57
gikari	57
yoroheje	57
wose.	57
umwe.	57
atazifuza	57
zari	57
utaha	57
akoresha	57
uwoze	57
muriri	57
Petero	57
bwawe.	57
kavukire.	57
bikenewe	57
wakora	57
kuki?ze	57
kugufasha	57
Wa	57
twa	57
byacu	57
baruwa	57
kubantu	57
gusa,	57
imbwebwe	56
nagize	56
nyanja	56
ngombwa.	56
mwandiko	56
umeze	56
ningofero	56
atashoboye	56
arebe	56
adakunda	56
nzaguma	56
sinumva	56
dushaka	56
rwanjye.	56
kegereye	56
Naganiriye	56
inyoni	56
kurwana	56
Berezile	56
shusho	56
ry'ubururu	56
arya	56
Icyampa	56
Ndemera	56
yishimiye	56
Madamu	56
bwinshi	56
azigera	56
tujya	56
zishobora	56
ireba	56
byanjye	56
Mutekereza	56
ntuzibagirwe	56
perezida	55
gace	55
ziri	55
n’abantu	55
mubucuruzi	55
Ntawe	55
nizeye	55
kumusura	55
tutari	55
intoki	55
igiti	55
ibiro.	55
ntazigera	55
nkiki	55
y'uruzitiro	55
atakoze	55
shelegi	55
bivuga	55
ingabo	55
y’u	55
umugati	55
kwiyumvira	55
nkeka	55
Ibintu	55
gutandukana	55
nahitamo	55
ryirabura	55
nikirahure	55
guhungabana	55
kwiga.	54
yegamiye	54
hanze.	54
fagitire	54
umenye	54
ibiti	54
kugira.	54
make.	54
bakiri	54
akamenyero	54
yamenetse	54
numweru	54
by'ukuri	54
uguta	54
azagaruka	54
numvaga	54
Aba	54
isimbukira	54
mushinga	54
Madonna	54
atazasubira	54
byose,	54
ryakeye	54
kuhagera	54
nibintu	54
byagaragaye	54
yahise	54
Abo	53
New	53
tubona	53
twagiye	53
kuzuka	53
guteka	53
azagera	53
nk'ukoze	53
abe	53
Niwowe	53
atuye	53
yatinze.	53
buhoraho	53
guhangana	53
n'umwana	53
gitekerezo	53
biteguye	53
yize	53
ahita	53
hasi.	53
ijana	53
asimbuka	53
cyatakaye.	53
gushakashaka	53
ishyamba	53
mahanga	53
ndirimbo	53
Kristo.	53
nitsinda	53
ikomeye	53
yonyine	53
nyakatsi	53
gutinda	53
nibyiza	53
umutuku	53
ndabona	53
ubukungu	53
we,	53
kwishimira	52
Agomba	52
cyumweru.	52
bibaho.	52
ubuhanga	52
politiki	52
isa	52
azunguza	52
amaguru	52
raporo	52
bibazo	52
[S]	52
guseka	52
ataza	52
babona	52
yishe	52
menshi.	52
sosiyete	52
Tokiyo	52
nashakaga	52
azamuka	52
bihenze	52
kuzinukwa	52
bwoko	52
rugendo	52
yerekanye	52
sibyo.	52
nabura	52
n'umuhungu	52
amasomo	52
bivugwa	51
mutima	51
amashuri	51
nagiye	51
Nkurikije	51
kibaho	51
nigihe	51
kamaro	51
kwirinda	51
Intumwa	51
ikirenge	51
nyandi	51
Mariya?	51
ibice	51
nda	51
Ndimo	51
Sawuli	51
idukuru	51
akababaro	51
wayo	51
nundi	51
gusiganwa	51
gushakisha	51
bakora.	51
nkiyi	51
kera.	51
rugo.	51
gutongana	51
nonaha	51
uhuye	51
ritukura	51
rifite	51
yabantu	51
yandika	51
impapuro	51
gitabo.	51
ibidukikije	51
bigaragaza	51
mugikoni	51
izindi	51
yatinze	51
mfashe.	51
gutura	50
ikuzimu	50
irari	50
adashishikajwe	50
myenda	50
ata	50
gucengera	50
ntuzashobora	50
Mumbabarire	50
Natinyaga	50
wewe	50
yangiriye	50
kwakira	50
y'agaciro.	50
gusinzira.	50
imyitwarire	50
yukoze	50
kumuha	50
yurira	50
igenda	50
bwayo	50
impaka	50
abanyarwanda	50
butumwa	50
kwitonda	50
yameza	50
mask	50
atoga	50
ubwato	50
kirori.	50
ham	50
y'umuhondo	50
kurusha	50
mwese	50
mpera	50
wihariye	49
bidashoboka	49
runini	49
yibwira	49
guhabwa	49
rwabo	49
imangazini	49
yigiti	49
igifaransa,	49
gucengeza	49
Karasira	49
igihembo	49
ndobo	49
abonye	49
amukunda	49
racket	49
hazabaho	49
gucuruza	49
Yizeye	49
imigambi	49
mbizi	49
Bizaba	49
Ntangiye	49
ingorane	49
kumena	49
Yamugiriye	49
ibiciro	49
bashoboye	49
igiye	49
imodoka.	49
Urabizi	49
nteruro	49
zingahe	49
wamaguru	49
bisaba	49
kose.	49
imifuka	48
wavutse	48
abakobwa	48
akanya	48
igika	48
bava	48
n’ubutumwa	48
ute	48
pawulo	48
t-shati	48
amabuye	48
gitukura	48
gituma?ze	48
byukusenge.	48
yumusozi	48
grill	48
bishimishije	48
kuraga	48
bw’ubugingo	48
petero	48
Nkwiye	48
ikiyapani.	48
bihuriye	48
yamusabye	48
Ikigaragara	48
firime.	48
yigitare	48
n'imbwa	48
yatuma	48
musaza	48
wanyu	48
riri	48
umubyeyi	48
bagombaga	48
ntiyatekereza	48
yisoko	48
bimwe.	48
yavuze.	48
Uzagomba	48
ke,	48
ndwaye	48
Mbere	48
iwe	48
amategeko	48
itaha	48
anywa	48
uhagije.	48
ngenda,	48
hantu.	48
n’inshuti	48
gupima	47
gukira	47
agere	47
waze	47
adateganya	47
tapi	47
arwaye.	47
uvugana	47
bafashe	47
abari	47
intebe	47
igera	47
yarashatse	47
kuroba	47
Byaba	47
mumodoka.	47
gutonyanga	47
gufungwa	47
Uko	47
muryango.	47
Korinto	47
Guverinoma	47
Ubwa	47
shokora	47
Inshuti	47
wumugabo	47
gihagije	47
umwanya.	47
moto	47
mugomba	47
ateye	47
john	47
Mana	47
ibyaha	46
Hamwe	46
asubira	46
muzi	46
gahunda.	46
ibikenewe	46
niyi	46
nyandiko	46
utazongera	46
gukiza	46
kwibaza	46
agahinda	46
yansabye	46
ananiwe	46
cyacu	46
mwobo	46
gukura	46
n'abandi	46
twe	46
umuti	46
ahuriye	46
Inama	46
uhuze	46
Yagiye	46
itabi.	46
muganga.	46
atangira	46
kumubona.	46
inzira.	46
gushushanya	46
ishavu	46
nzanyura	46
akomeza	46
umusaruro	46
kuhaba.	46
ndorerwamo	46
ijwi	46
aje	46
injangwe	46
yaguye	46
Umukecuru	46
Abanyamerika	46
TV.	46
Musinga	46
bisanzwe	46
gukuramo	46
Ndagerageza	46
Umwuka	46
tuza	46
yabaye	46
bw’Umwuka	46
ubuhe	46
urubura	46
kuroba.	45
isuku	45
imana	45
imbeho	45
korari	45
nkaze	45
umunyamabanga	45
yatsinze	45
murikara	45
Umufasha	45
kevin	45
inzoga	45
baryamye	45
hagomba	45
muhira	45
urwo	45
ibikorwa	45
nabyo	45
kurya?	45
ikamba	45
kujugunya	45
bigenda	45
gutegura	45
Namusabye	45
gutunga	45
namugiriye	45
imbabazi.	45
y’urugo	45
zitandukanye	45
Umaze	45
kuntu	45
kiza	45
bisekeje	45
Ntushaka	45
un	45
kugaragaza	45
yizuba	45
kumuryango	45
batuye	45
ingufu	45
wagira	45
TV	44
Uzumva	44
Nk’uko	44
uzwi	44
ntangiriro	44
icyarimwe.	44
yagumye	44
bemeza	44
Bavuze	44
Aya	44
bijyanye	44
ukore	44
kunyura	44
ryiza	44
nimugoroba.	44
bubaka	44
yatangiye	44
zera	44
umuzimu	44
ingingo	44
guhitamo	44
kibaho.	44
mafaranga	44
ukomeje	44
w’Uwiteka	44
ukoze	44
Muziranenge	44
nubururu	44
intambwe	44
amubwira	44
yapfuye.	44
ahugiye	44
guhama	44
kubaha	44
nde	44
wera	44
butandukanye	44
ihora	44
kizagera	44
b’i	44
Ndi	44
ngofero	44
Tito	44
gutaha.	44
yaramubwiye	44
babana	44
yahawe	44
sasita	44
jya	44
kugurisha	44
izagenda	44
yiga	44
twifuza	44
umugabane	44
itorero	44
nzabona	44
bikiri	44
kenny	44
mibereho	44
atuye.	44
ahawe	43
Yarababwiye	43
yumugabo	43
Ntiyigeze	43
ataba	43
ze,	43
byoroshye.	43
s’ibyo	43
tuzakunda	43
n’abadafite	43
gukwira	43
ruzi	43
asigaye	43
yidirishya	43
tutabifashijwemo	43
yavuye	43
Murumuna	43
kwiba	43
kubwiriza	43
badafite	43
gusinzira	43
r	43
uzagira	43
agwa	43
umuririmbyi	43
yabikoze	43
busanzwe	43
N	43
y’Imana	43
yumutwe	43
yatanze	43
n’umutima	43
yoza	43
mur	43
ntakeneye	43
ubuyobozi	43
w	43
tumenye	43
igifaransa.	43
uvuga.	43
Ntibisanzwe	43
yayo	43
utambwiye	43
cye,	43
Ruganzu	43
ingamba	43
urusaku	43
nteganya	43
numupira	43
byumvikana	43
ate	43
aricyo.	43
guhangayika.	43
serivisi	43
akundana	43
Smith	43
banki	42
bitabo	42
impuhwe	42
kijyanye	42
abashakanye	42
ryabagabo	42
amateka	42
kukubabaza	42
ngo:	42
akaga	42
Ninde	42
rufite	42
nzareba	42
atazabibona.	42
n'abagore	42
stade	42
yongere	42
ibindi	42
Ndifuza	42
mfite.	42
urufunguzo	42
hepfo	42
Amaze	42
njyenyine	42
tatouage	42
ibicuruzwa	42
gukonja	42
bikunze	42
bifata	42
ujye	42
imbaga	42
akwiriye	42
kuririmba	42
tutagomba	42
bihagije.	42
nzongera	42
ibisobanuro	42
iterambere	42
ihari	42
asimbukira	42
n’abigishwa	42
witeze	42
Igitekerezo	42
kugoboka	42
nabo.	42
kubanza	42
inzozi	42
umwete	42
mvuga.	42
byibuze	42
kunguka	42
inyamaswa	42
biruka	41
umuvuduko	41
muto.	41
akonje	41
kuboha	41
mahanga.	41
ubuvunnyi	41
kumwumvira	41
gituza	41
kumurongora.	41
bakorera	41
kinini.	41
Nanyarutse	41
urwaye.	41
ahuza	41
n’imbaraga	41
Akenshi	41
nigitambara	41
burigihe	41
kwatumye	41
bitagenda	41
kumufasha.	41
Nyina	41
Arimo	41
kumesa	41
rirenze	41
haba	41
bazamuka	41
biragoye	41
ntuzibagir	41
amadirishya	41
hariya	41
tuzaba	41
y'ubururu	41
azabona	41
nibuka	41
muntu.	41
bibaye	41
gukubita	41
wogosha	41
igitsina	41
yavugaga	41
bangahe	41
bizera	41
ukundi	41
yumuryango	41
bavuye	41
yahamagaye	41
gukinira	41
kuregwa	41
kutabikora.	41
zirimo	41
zitukura	41
yububiko	41
umushyitsi	41
sinatekerezaga	41
Nemereye	41
bibuka	41
utamarana	41
nkumuntu	40
agurisha	40
ukimara	40
witeguye	40
yemeje	40
atazaza	40
gucukura	40
Umunyeshuri	40
ndimi	40
ufasha	40
Ndashobora	40
rimwe,	40
byabo	40
Mbwira	40
heza	40
mushya.	40
nariye	40
Databuja	40
Kubwamahirwe	40
Urumva	40
kwirabura	40
kurwego	40
abakozi	40
maguru	40
n'itatu.	40
kiriya	40
tuzagerayo	40
biterwa	40
maboko	40
zose.	40
atatse	40
mubona	40
imico	40
induru	40
umufuka	40
dushyire	40
byingenzi	40
kuboko	40
kogosha	40
mbonye	40
ikanzu	40
kigeze	40
Umugeni	40
abaza	40
nkayo	40
??nakoze.	40
uyisoma.	40
bizabaho	40
mutari	40
twizera	40
bitangaje	40
Twabonye	40
bavugako	40
yahindutse	40
bakaba	40
yashimishijwe	40
Pacifique	40
gukuraho	40
kuvura	40
yahinduye	40
y'icyatsi	40
yatewe	40
ryose.	39
gukundana	39
nkiri	39
umwana.	39
kwanga	39
bakoresha	39
Umukiza	39
bibero	39
kubivuga	39
agenda.	39
gisirikare	39
kuramya	39
ahagije.	39
yibeshye	39
afite.	39
adakora	39
ifata	39
yabaga	39
cyiki	39
urebye	39
yabi	39
ibirahure	39
apfuye	39
gitaha	39
burundu	39
umusanzu	39
Ntaraza	39
yarabuze	39
jeans	39
zanjye.	39
kwifatanya	39
bakwiriye	39
itandukaniro	39
yabitekerezaga.	39
rusengero	39
kumwanya	39
Nakekaga	39
Gari	39
mwinshi	39
umupererezi	39
York	39
ntibakunda	39
Mubyukuri	39
irambuye	39
amakoti	39
baganira	39
y'abantu	39
mumugare	39
Birumvikana	39
isanzwe	39
ububabare	39
iherezo	39
bakomeje	39
yitegura	39
karere	39
izagwa	39
enye	39
akabikora	39
bakavuga	39
nitegure	39
gatanu.	39
Ntegereje	39
badashobora	39
gusega	39
ubuntu	39
mateka	39
atatu	39
wawe?	39
murito	39
muririma	38
mubantu	38
nawe?	38
mumihanda	38
nkimyitozo	38
cyacu.	38
tubonye	38
ahandi	38
bisanzwe.	38
n'ikoti	38
kimenyetso	38
cyingenzi	38
Kevin	38
imitima	38
yongera	38
mumyaka	38
nigice.	38
atazitabira	38
ntibazi	38
ibitekerezo.	38
kiganiro	38
avuza	38
makuru.	38
bagerageza	38
mpuzabitsina	38
ukaba	38
njyenyine.	38
yarezwe	38
Ntazava	38
bigana	38
impano.	38
Dore	38
kawa	38
nayo	38
ashaka.	38
cyubururu	38
ndashobora	38
n'umugabo	38
bishimye	38
hose.	38
gushobora	38
meza.	38
ziparitse	38
byombi	38
gicamunsi	38
wabonye	38
umucyo	38
kuvuna	38
naba	38
Nabwiwe	38
muripira	38
ibisubizo	38
Yezu	38
kugaburira	38
yikiyaga	38
ikimenyetso	38
ngenda	38
Abakristo	38
gereza	38
mugira	38
mucyumba.	38
bakomeza	38
ahangayikishijwe	38
kubijyanye	38
mugitondo.	37
Ntukemere	37
Nabajije	37
wansabye	37
Gloria	37
umukene	37
yizeye	37
Katsumi	37
basanzwe.	37
byavuzwe	37
ntambwe	37
yirinde	37
zijimye	37
yumupira	37
agasanduku	37
kuzigama	37
inka	37
ntarya	37
nzatakaza	37
hamwe.	37
cyuzuye	37
aganira	37
atishimiye	37
nange	37
urutare	37
bikini	37
icyaha	37
kizamini	37
irasimbuka	37
ryabana	37
Mbese	37
kuuriya	37
atarya	37
nkambi	37
niwe	37
Yohana.	37
kumfasha	37
kugaruka	37
bumoso	37
kiganiro.	37
kuzamuka	37
guhangayika	37
ibinyobwa	37
kwitegura	37
mugaragu	37
munyabute	37
bugomba	37
ntuje	37
guterura	37
Erega	37
ubugome	37
ntakunda	37
murintu	37
ubutegetsi	37
gaciro	37
Abanyarwanda	37
abavandimwe	37
rupfu	37
mubibazo	37
agomba.	37
kuribwa	37
munsi,	37
wagenda	37
basa	37
kumenyekana	37
twabyumviye	37
mwuzuzwa	37
Sinashoboraga	37
bushobora	37
umuvugizi	37
ikitagenda	37
bihugu	37
indimi	37
ndya	36
mw’ijuru.	36
bigana.	36
utavuga	36
yisumbuye	36
ubusanzwe	36
yategetse	36
ararakara	36
inkingi	36
bishya	36
Amaherezo	36
murinsi	36
utabishaka.	36
navuze	36
byananiranye.	36
reba	36
igira	36
imisatsi	36
vuga	36
bundi	36
Bob	36
byukusenge?	36
aramwenyura	36
guhakwa	36
bashigikire	36
y’iwabo	36
ida	36
mumaboko	36
namakuru	36
hakurya	36
zi	36
wavuye	36
bintu.	36
gute,	36
Yashakaga	36
gutunganya	36
azajya	36
Nagize	36
kwenda	36
rwe?	36
kubona.	36
mpuze	36
rwari	36
birenze	36
bombo	36
ikawa	36
ntawe	36
amusoma	36
cyihariye	36
amenyo	36
beto	36
akore	36
Natekerezaga	36
umubare	36
wumupira	36
atibuka	36
kumubwira	36
ikihe?	36
kumurongora	36
kigomba	36
ibyatsi	36
urujijo	36
n’ibyo	36
abahanga	36
kuzamura	36
biva	36
golf	36
banyeshuri.	36
kuzuza	36
yambwiraga	36
yumvikana	36
itege	36
Ntiyashoboraga	36
amubaza	36
munzu	36
John.	36
gishimishije.	36
yakubwiye	36
nkimara	36
Vuba	36
uhagarike	36
uhuriye	36
atazakundana	36
umwenyura	36
yitaye	36
n'umuryango	36
weekend	36
cyera	36
Ubusanzwe	36
guhobera	35
cyerekezo	35
umuswa	35
ntushobora	35
aderesi	35
amahoro.	35
S	35
ibiyirimo	35
udakwiye	35
byagombaga	35
ibintu.	35
asunika	35
ibyago	35
bwabo.	35
graffiti	35
Brian	35
dufashe	35
jacket	35
bikabagora	35
ndizera	35
aribyo	35
mashini	35
ubikoraho	35
utabwiye	35
Kera	35
gutema	35
igihanga	35
nigare	35
tutaguye	35
stage	35
yikawa	35
abayoboke	35
kizakugirira	35
yinka	35
ngu	35
wakoze	35
mubintu	35
mwaka?	35
ntutindiganye	35
ndushye	35
ugaragara	35
yatandukanye	35
kabo	35
byagendekeye	35
uwa	35
utuye	35
kwari	35
ingirakamaro	35
umusitari	35
isahani	35
yasize	35
bana.	35
imfashanyo	35
kwiringira	35
Abazungu	35
yabajije	35
byanze	35
umworozi	35
kutabangamira	35
kopi	35
rubyiruko	35
Hagati	35
Tuzakora	35
kubivuga.	35
atuje	35
mwaka.	35
agakora	35
yintambwe	35
ukurikije	35
bagize	35
kora	35
urungano	35
kumurima	35
nzana	35
Imodoka	35
Naje	35
nzu.	35
ingeso	35
w'icyuma	35
icyizere	35
Julie	35
niyompamvu	35
y'u	35
gushyingirwa	35
mukunda	35
gishya	35
kuberako	35
kurya,	35
bamwenyura	34
muti.	34
kumufata.	34
Na	34
anita	34
y'ibiti	34
akora.	34
N’Umwami	34
batungwa	34
yatoranyirije	34
mugaragaro	34
kagabo	34
ibyo?	34
rikomeye	34
yukwezi.	34
yishusho	34
yibwiraga	34
gikorwa	34
Nahisemo	34
cyijimye	34
Ibyokurya	34
nibyingenzi	34
gufatwa	34
wenda	34
Umukozi	34
ababwira	34
gicucu	34
gihe,	34
azize	34
mucyumweru	34
weekend?	34
kumunwa	34
umwuga	34
wirabura	34
interuro	34
Yasezeranije	34
I	34
impamvu.	34
Ijwi	34
nkubonye	34
umushahara	34
hakurikijwe	34
mpaguruka	34
Kelly	34
babe	34
Alice	34
narinjiye	34
amazina	34
Roma	34
acukure	34
bitewe	34
ishimishije	34
mwembi	34
amahame	34
ariyo	34
y’ubugingo	34
bye?	34
atarangije	34
yaratwawe	34
inyangamugayo	34
abashe	34
igifaransa?	34
yumweru	34
Ujye	34
uzirikana	34
myinshi.	34
mumagufwa	34
imboga	34
ugereyo?	34
yiki	34
Ntukumve	34
bacu	34
Uku	34
kugashya	34
nsezeranya	34
isosiyete	34
gukurura	34
wabuze	34
gitaha.	34
muribi	34
uburebure	34
ahari.	34
ricururiza	34
gutsinda.	33
n’umuhungu	33
urugi	33
kubigenza.	33
ahagaragara	33
yintebe	33
ine	33
impongano	33
benshi.	33
yimyenda	33
bimeze.	33
ukomeza	33
rivuga	33
ryawe	33
ikwiye	33
bamaze	33
ahitamo	33
kenshi.	33
ijana.	33
twakora	33
byacu.	33
gushishikara	33
bameze	33
bakagombye	33
produit	33
Revlon	33
kurushinga	33
mubyiciro	33
Efeso	33
iwawe	33
ikinyabupfura	33
Nzabaza	33
abivuga.	33
busitani	33
ibihumbi	33
uzambwira	33
bazamera	33
nk’amabuye	33
kumarana	33
aribwo	33
ibirahuri	33
azanga	33
yizeraga	33
kuboneka	33
ikarita	33
Ntubona	33
hafi.	33
Yamusobanuriye	33
Yumvise	33
kurasa	33
izagera	33
yambara	33
ke.	33
uzumva	33
kari	33
wabi	33
y’iyi	33
mivurungano	33
wagombye	33
bagira	33
Ubushakashatsi	33
utajya	33
atanshaka	33
ubugingo	33
kug	33
ndabizi	33
bimera	33
yan	33
n'inshuti	33
amezi	33
isiganwa	33
kubiuriyara	33
ntumva	33
mvuye	33
ryari?	33
Kuko	33
mwami	32
nyubako	32
musozi	32
nako	32
Umuyobozi	32
nakugira.	32
ngomba.	32
uburemere	32
biroroshye	32
tugira	32
yumubiri	32
ijuru.	32
umunezero	32
gukorwa.	32
Tokiyo?	32
icyuma	32
yarangije	32
rwiza	32
gihagaze	32
Gatama	32
arenze	32
yarebye	32
atazemera	32
ntego	32
gusanganira	32
bikanatera	32
yongeraho	32
tumeze	32
imizigo	32
imibare	32
cyambu	32
kibazo,	32
bibwiraga	32
beza	32
ibikinisho	32
ahitemo	32
yibi	32
umuhati	32
gusiba	32
umwere	32
mug	32
yahoraga	32
Londres	32
Iyaba	32
nkaryama.	32
Mubera.	32
Nategereje	32
Iteka	32
iyihe	32
kugutenguha.	32
ishema	32
ntibabaho	32
kirere.	32
amababi	32
yaratangiye	32
mukirere	32
Urateganya	32
musozi.	32
Nku	32
ajye	32
kubumba.	32
imigisha	32
ukoresha	32
microscope	32
bibi.	32
mubucuruzi.	32
kumusenyi	32
ibibera	32
kujyayo.	32
Sally	32
amatike	32
nkomeze	32
intara	32
Ken	32
Ibihangange	32
Witondere	32
hazaza	32
kumvira	32
niteguye	32
nabikora.	32
kurera	32
rugi	32
ntatekereza	32
Nakoze	32
rishya	32
umugani	32
ujyayo	32
mubisanzwe	32
usanzwe	32
sintekereza	32
parasute	32
abayobozi	32
akareba	32
gusohokana	32
Ngerageza	32
yar	32
ibuye	32
intekerezo	32
ibyishimo	31
gutsimbarara	31
utarangije	31
igihombo	31
zihagarara	31
agezeyo	31
ntakoze	31
ukomoka	31
gusoza	31
yisubirire	31
kubiuriyara.	31
kuza.	31
Kinyarwanda	31
ubucuti	31
aracyari	31
yarasaze	31
yishwe	31
ar	31
Rwanda.	31
gushyigikira	31
tukiri	31
ntiyacengera	31
ifunguye	31
ntagukunda	31
yubucucu	31
n’iyo	31
nke	31
bigisha	31
kigo	31
bihinduka	31
Nabyutse	31
kuguruka	31
ubutabera	31
ibyawe	31
byambo.	31
y’abantu	31
umutwaro	31
biriya	31
ikirahure	31
cyubupfu	31
sima	31
mumenya	31
ishanga	31
kiraro	31
Hasigaye	31
uzaza	31
byanjye.	31
azagarura	31
yataye	31
Yizeraga	31
Yabyutse	31
byatuma	31
unywa	31
yakinguye	31
tugere	31
Imyaka	31
muko	31
nagerageje	31
kuvugama	31
mucyo	31
ntiyitaba.	31
kugabanya	31
azamura	31
mato	31
kwezi.	31
uta	31
Oya	31
Imbaga	31
imwe,	31
dukunda	31
gushimwa	31
atagiye	31
babashe	31
kubamenyesha	31
abigishwa	31
ubwira	31
bitekerezo	31
kumufata	31
nkufite	31
umurimo.	31
ugerageza	31
wumukobwa	31
nigare.	31
nkawe	31
isuku.	31
yatangaje	31
ubwami	31
urwenya	31
andi	31
pome	31
kubeshya	31
bwose.	31
ira	31
kubafasha	31
Nizeye	31
leta	31
ingenzi	31
Aha	30
umunyu	30
murijyi	30
Ntumbwire	30
Yavugaga	30
…	30
atarekewe	30
zacu	30
yanyu	30
ijipo	30
igurisha	30
wibyatsi	30
bakunze	30
mubirori.	30
utabyitayeho	30
iheruka.	30
Ndahamya	30
batazigera	30
yarakaye	30
mudugudu	30
bukomeye	30
yateguye	30
cyaje.	30
wumujyi	30
Turi	30
Namenye	30
gutyo	30
Bibiliya	30
sisitemu	30
kwanika	30
Lucky	30
umwotsi	30
imikorere	30
bishimira	30
inyuma.	30
Ubuyapani	30
Jowani,	30
abiri.	30
umwijima	30
cyane?	30
Umwe	30
Sinarinzi	30
umukiriya	30
mumi	30
bahagarara	30
ucuranga	30
byera	30
yurukuta	30
akumva	30
ecran	30
gakondo	30
Nzagaruka	30
ambaza	30
bizagenda.	30
ugize	30
narabikoze.	30
ikangurira	30
yishyinguye	30
abikora	30
nasohokaga	30
barishime.	30
niya	30
nigera	30
amakimbirane	30
umujinya	30
busa	30
angahe	30
skateboard	30
nindege	30
kunyerera	30
Ko	30
ijosi	30
uhora	30
kwirata	30
yumuriro	30
kwigaragaza	30
ryabasore	30
wakundaga	30
kurangira	30
ibanga.	30
ntera.	30
kubo	30
Joriji	30
yakuye	30
indorerwamo	30
bifasha	30
impunzi	30
n'abantu	30
Impamvu	30
amabanga	30
amazu	30
yi	30
idasanzwe	30
amoshya	30
ubona.	30
rwema	30
ubishaka.	30
Ukeneye	30
abagize	30
ibaruwa	30
azashaka	30
kuririmba.	30
irashobora	30
akwiye	30
atukura	30
nibi.	30
kukazi	30
gakomeye	30
ariwo	30
Tuzakuraho	30
buke	30
nyaburanga	30
Fata	29
None	29
ntiyakundaga	29
yakuriyemo.	29
kubahiriza	29
gusimbuka	29
bajyaga	29
mabisi.	29
amagare	29
ry	29
bishoboka,	29
witwa	29
kurondogora	29
guuriyara.	29
gusakuza	29
nibyo.	29
nkaya	29
kumugirira	29
yandi	29
imbere.	29
nishimiye	29
kumunsi.	29
yagombye	29
umukinnyi	29
Nyirarume	29
ishize.	29
ntiwari	29
mo	29
gusa?	29
club	29
Tanganyika	29
Ntibishoboka	29
byihuse	29
izatangira	29
Ngwino	29
bizoroha	29
azanyishyura	29
ntiyubahiriza	29
Ukurikije	29
gucika	29
Azaba	29
umubabaro	29
afunguye	29
bavugana	29
Nzajya	29
udasanzwe	29
wumugore	29
ukubona	29
nonaha?	29
guteza	29
guhera	29
igaragare.	29
ngingo.	29
Ikindi	29
agendera	29
azahindura	29
umuryango.	29
rubanda	29
fiziki	29
niga	29
birenga	29
kirwa.	29
Yemeza	29
yintambara	29
bose.	29
Mana.	29
beret	29
ibi,	29
ukoresheje	29
yuwakane	29
sinashoboraga	29
histwari	29
Bashaka	29
nabwo	29
ntera	29
ineza	29
Kuvuga	29
yemeye	29
imishinga	29
feri	29
undi.	29
kwiyitaho	29
Gasabo	29
azunguruka	29
nzemera	29
natekereje	29
nzaza	29
amenye	29
mwuka	29
bakinnye	29
akubwira	29
mfashe	29
n’uyu	29
ihame	29
kwara	29
umudendezo	29
ategeka	29
Urukundo	29
azamburwa.	29
mpapuro	29
natekerezaga	29
bucuruzi	29
w’i	29
mazina	29
bass	28
kwikorera	28
umpamagaye	28
Suzuki	28
yigihe	28
n’abaturanyi	28
nabagore	28
hejuru.	28
gishimishije	28
zawe?	28
amushinja	28
zibaho	28
bite	28
itu	28
james	28
kibaho?	28
asinziriye	28
ruswa	28
nuburyo	28
imigenzo	28
birimo	28
Kivu	28
yabyo	28
ahurira	28
Nil.	28
tujyana	28
..	28
aruta	28
Kamali	28
atankunda.	28
yukorwa	28
Mime	28
kumuririmbyi	28
henshi	28
kiyaga.	28
kwi	28
witwaje	28
Timoteyo	28
ntiyabikora.	28
yageze	28
ntibifuzaga	28
umucuruzi	28
gutwara.	28
Narinzi	28
myinshi	28
kato	28
feza	28
ataje	28
keke.	28
mugongo	28
yagiye.	28
n’umurimo	28
Frisbee	28
mbaraga	28
babikora	28
baseka	28
imikino	28
k'igihe	28
uguma	28
sandali	28
ziva	28
yanjye?	28
twavuga	28
umutaka.	28
Afurika	28
Roma.	28
Nigeze	28
ntagufasha.	28
arareba	28
araseka	28
bati	28
migenzo	28
bateranira	28
barebe	28
simbyitayeho.	28
uyumunsi	28
mpunzi	28
bazana	28
ibye	28
kote	28
hasigaye	28
amarira	28
ingaruka.	28
icy'ingenzi	28
ubumwe	28
igikoresho	28
nzataha	28
murikobwa	28
n'imwe	28
imipira	28
navuga	28
he?	28
irushanwa	28
akimara	28
kanini.	28
imvura.	28
yamazi	28
Bisaba	28
muhe	28
wumusatsi	28
uzampa	28
umbwira	28
iteye	28
ntiyamwemerera.	28
birasa	28
cape	28
bikajyana	27
asinzira	27
urangiye.	27
wayo.	27
kano	27
bafitanye	27
tanu	27
asa.	27
cyoroshye	27
cyanjye,	27
uuriya	27
umuyaga	27
ikariso	27
izihe	27
bazemera	27
ziruka	27
Ndacyafite	27
ashishikaye	27
twumvikanye	27
urukuta	27
batangiye	27
mukundana	27
nabikora?	27
minisitiri	27
Yabwiye	27
nke.	27
kibi.	27
amatorero	27
ibirenze	27
misozi	27
isuka	27
bakomeye	27
yarakoze	27
ndagusaba	27
imyumvire	27
gukata	27
butaka	27
nikintu	27
Abaganga	27
mbeho	27
moshi.	27
nabikora	27
mpeshyi	27
koga.	27
bimuha	27
Byabaye	27
Papa	27
nshuti	27
wikendi	27
turashaka	27
yukoresha	27
Wifuzaga	27
igi	27
utumva	27
Ubwenge	27
mariya	27
y'umwijima.	27
wumwirabura	27
plastiki	27
magare	27
baroba	27
z'ijoro.	27
bitabaho	27
Jane	27
ntampamvu	27
Yagenze	27
Lang	27
yitwa	27
gusabiriza	27
wambwiye	27
ubonye	27
kwanura	27
buhanga	27
kwibanda	27
Tugiye	27
bacuranga	27
kuruhuka	27
birori.	27
ntakindi	27
mubyeyi	27
wambere	27
itandatu	27
amahitamo	27
ngabo	27
ukundi?	27
twitwara	27
bar	27
Njye	27
Ruhinda	27
yamurobanuye	27
mukino	27
akeka	27
wasabye	27
ibirometero	27
wishyuye	27
yababajwe	27
azagaragara	27
atyo.	27
skate	27
nzajya	27
Bagize	27
bwagaragaraga	27
kwigerezaho	27
kurushaho	27
iriya	27
mubiri	27
perezida.	27
Tomasi	27
bitaba	27
kuzamurwa	27
nzahindura	27
utunganye	27
agenzura	27
banyamahanga.	27
igisigo	27
akagura	27
cy'indege	27
amabwiriza	27
muturage	27
utangira	27
gusuhuza	27
umupolisi	27
kugusaba	27
Amerika?	27
inshuti.	27
Nzaguhamagara	27
ikomoka	27
kwiyemeza	27
yajyaga	27
yakundaga	27
basaba	27
Sobanura	27
Nzakubwira	27
kum	27
urupapuro	27
Imvura	27
nguha	27
ntawundi	27
ntikiragera.	27
Tok	27
y’uko	27
umudamu	27
yumunsi	27
byabaye.	27
Mufite	27
yego.	27
kumpamvu	27
atwigisha	27
numukunzi	27
birashobora	27
Urimo	27
abapolisi	27
gutabara	27
n’	26
y’imbohe	26
w'akarere	26
maduka	26
ntazoroherwa	26
byo.	26
isano	26
ihiye	26
birashya	26
bayirimo	26
bashye	26
mugozi	26
nabikoze	26
uzamenye	26
yishyuye	26
amafi	26
uva	26
itagwa	26
yakwihutira	26
n’umukobwa	26
atemerewe	26
gisa	26
igumane	26
tuzagira	26
bimenyekanye	26
tube	26
wagerageza	26
biryo	26
itwara	26
atabonye	26
kwag	26
ikaba	26
nukumenya	26
Ositaraliya	26
atwaye	26
Ntawabura	26
gusezerana	26
bizagorana	26
y'amabara	26
cyo.	26
bikora	26
nahoraga	26
iya	26
atazishimira	26
nyirabukwe.	26
byabaga	26
bamwishe,	26
bamusunitse	26
nigice	26
gikomeye.	26
yababaye	26
twiteze	26
yihuta	26
murimo.	26
usigaye	26
rigamije	26
Umu	26
masenge	26
gutandukanya	26
byantwaye	26
basinziriye	26
ryaravuganye	26
n’imitima	26
barenga	26
byagenze.	26
bwaba	26
Turashobora	26
Biyumvishaga	26
inyubako	26
twagombaga	26
Nahitamo	26
agapira,	26
corkscrew.	26
imitwe	26
nk'ukuri	26
gukererwa	26
gusetsa	26
intera	26
isegonda	26
trix	26
Wambwiye	26
byatumye	26
igabanya	26
gutora	26
umuk	26
umucamanza	26
Yamubwiye	26
Ndetse	26
ryanjye.	26
amubwire	26
kasi	26
Inyamaswa	26
urya	26
wamaguru.	26
tuzabi	26
Byanditswe	26
bizakugirira	26
ubishaka	26
ibishyimbo	26
n'ubwanwa.	26
ryayo	26
kubahuka	26
Nabwiraga	26
ntabishaka.	26
numusore	26
kizaza	26
ntuzigera	26
Amaso	26
atamurakariye.	26
twabi	26
tutabi	26
wumuzungu	26
iperereza	26
masaha	26
abajije	26
dusuzumye	26
twitonze	26
nk'u	26
indakemwa	26
narangije	26
hakonje	26
murihungu	26
iriruka	26
Asaba	26
usoma	26
mukabari	26
itike.	26
bwinshi.	26
mumufasha.	26
yibiti	26
kutabwira	26
nyamwinshi	26
Abari	26
nakora	26
bidafite	26
asanzwe	26
itanga	26
Sinkeneye	26
ntukemere	26
aguha	26
utamwumva.	26
azavuga	26
Nagiye	26
bantu.	26
nikigera,	26
atadukunda	26
itangazamakuru	26
Noheri	26
igifu	26
mahoro	26
Mariya,	26
n'ikabutura	26
rwawe	26
utazemera	26
utankunda	26
barageze	26
A	26
dukora.	26
yuyu	26
Kamena	25
guhumurizwa	25
nanone	25
lisansi	25
Domitira	25
amafoto	25
yashobora	25
ubikora.	25
aramubwira	25
namara	25
mumateraniro	25
kubyemera	25
ingoboka	25
mitima	25
natinze	25
ibindi.	25
babanza	25
cyerekana	25
rubanza	25
nibiti	25
kigero	25
ubutaha	25
umukoresha	25
abawu	25
kirwa	25
manzi	25
inkoranyamagambo	25
uririmba	25
Niyo	25
umweru	25
ukoreshwa	25
ho.	25
adakoze	25
nkanjye	25
Christine	25
izuba.	25
azasaba	25
azwi	25
Wansobanurira	25
Ayo	25
Mazimpaka	25
bikimeze	25
gihe;	25
igitambo	25
yubwato	25
gukiranuka	25
ndenge	25
mucyumba,	25
ubungubu,	25
ntitugomba	25
Haba	25
mumutwe	25
bwerurutse	25
ntiyagira	25
arahaguruka	25
ukugira	25
guhesha	25
umunyabwenge,	25
adushoboza	25
nanze	25
gutenguha	25
umutetsi	25
bumvaga	25
yavugaga,	25
ngukunda.	25
abaho	25
cyabaye	25
ikoresheje	25
anet.	25
Uruhinja	25
nyamaswa	25
yicyapa	25
kugomba	25
ryogosha	25
bwumuntu	25
yihariye	25
wandakariye	25
wambabariye.	25
Nicyo	25
buzagenda	25
idiski	25
nzakora	25
iti:	25
azarakara	25
Numvaga	25
ufunguye	25
paki	25
Nk’u	25
kwiyuhagira	25
Inkongi	25
ntiyagaragara.	25
wibuke	25
Dawidi	25
n'ibiti	25
turamutse	25
iguriro	25
Nibagiwe	25
ikizamini.	25
utunguwe	25
abivuga	25
yikirundo	25
ry'umukara	25
kugaba	25
umunyabwenge	25
ngufi	25
Kor	25
umukozi	25
ikiruhuko	25
buryo.	25
akura	25
ukuguru	25
bamubwiye	25
cyakorwa	25
Nzakumenyesha	25
ugukabya	25
akambwira	25
bidashoboka.	25
Mushiki	25
bakabona	25
yimyanda	25
azamfasha	25
basore	25
kumwogosha,	25
Nukuri	25
Icyongereza	25
utabizi	25
uhagarika	25
uryamye	25
akomeje	24
bitugu	24
uburobyi	24
nakoresha	24
gake	24
kubw’umurimo	24
babaga	24
Icyangombwa	24
uzakomeza	24
igihaza	24
nicyatsi	24
Hashobora	24
ndangije	24
bagore	24
yananiwe	24
Biratangaje	24
ryabo	24
Bari	24
kunguriza	24
indege	24
Nkora	24
ane	24
Ndazamuka	24
Ariko,	24
rwamahanga	24
akajya	24
gikwiye	24
bampangayikira	24
bakoresheje	24
isafuriya	24
kitari	24
muririmo	24
arangije	24
nkibyo?	24
bitamubuza	24
bishwe	24
barwanyije	24
batinyaga	24
rubanda.	24
yaravuze	24
Gahunda	24
mufuka	24
antibiyotike	24
virusi.	24
nzitizi	24
cyatakaye	24
nakoze	24
ikibabaje	24
bwamamara.	24
Ndasezeranye	24
y'urukuta	24
diane	24
bahita	24
ukadufasha	24
umuhondo	24
witsinda	24
namukunze.	24
parade	24
imvugo	24
Akimara	24
yagaragaje	24
ishimwe	24
azasura	24
nzoka	24
ntamufashije	24
byawe,	24
ntafashe	24
imiti,	24
nzapfa.	24
tuta	24
ntazuyaze	24
gihe?	24
bitinze	24
moto?	24
ice	24
cream	24
uburere	24
amarushanwa	24
Nzabwira	24
zenda	24
n’umuntu.	24
bashimangira	24
sinabikora.	24
mumuryango	24
umukinyi	24
yakwishimira	24
mumurima?	24
kumwumvisha	24
mubihe	24
mvugana	24
w'amavuko	24
ngukunda	24
Muburyo	24
ri	24
tagisi	24
umugo	24
re	24
atuza	24
isahane	24
akangiza	24
Nzaguha	24
y’imihigo	24
akurikirane	24
ari,	24
ukorera	24
n’ubwenge	24
yitonze	24
agasanga	24
yubuzima	24
yirabura	24
tutagiye	24
urugamba	24
kuguriza	24
Nzabonana	24
imyanya	24
abatangabuhamya	24
batere	24
yamuhamagariye	24
udakundana	24
n'abasore	24
john?	24
mugufi	24
Isosiyete	24
kagare	24
ma	24
yanampaye	24
Numva	24
mpangayitse	24
dusa	24
darcy	24
wishimye	24
sinashakaga	24
mugezi	24
yitwaza	24
ishyari	24
kwibutsa	24
miremire	24
Kumva	24
munini.	24
gikombe	24
yegera	24
har	24
wuzuye	24
Gukubita	24
bakizwa.	24
ishami	24
y’umuriro	24
azazira,	24
Uru	24
kumanuka	24
Amategeko	24
uzamukiza	24
z'amahanga	24
basobanura	24
abasinziriye	24
ijuru;	24
atangaza	24
amazemo	24
bikunze.	24
rugamba	24
akatumenyesha?	24
ibona	24
umfasha	24
Nazareti	24
Urasa	24
utigeze	24
amatwara	23
yumukobwa	23
yiwe	23
yubucuruzi	23
zijyanye	23
nyi	23
amufata	23
salle	23
n’abana	23
wamenye	23
yoga	23
cyemeza	23
Nirukanywe	23
Kabera	23
agafuni	23
ingahe	23
ubone	23
Ijoro	23
unaniwe	23
mana	23
yikiraro	23
Ndashidikanya	23
nahisemo	23
bibera	23
mpa	23
imaze	23
rurimi	23
ntabi	23
Ubutaha	23
uvuye	23
twagize	23
umuhate	23
Kora	23
Yiyemeje	23
uburambe	23
ibyuma	23
kugenda,	23
Twari	23
banywa	23
yumutekano	23
ibijyanye	23
yiteze	23
Aratekereza	23
waltz	23
cyabaye?	23
rizaba	23
kubitekerezaho	23
mbura	23
isakoshi	23
politiki.	23
gitondo?	23
arasaba	23
nyungu	23
sandwiches.	23
umubona	23
numusatsi	23
ugaragaza	23
yasobanukiwe	23
kugura.	23
Nanze	23
atabivuze.	23
urebe	23
gusoma.	23
Yakoze	23
ushaka?	23
twe.	23
atigera	23
bandanna	23
utwara	23
fidel	23
nimugoroba?	23
nahamagaye	23
mubukwe	23
yabereye	23
arira	23
bw	23
Bagabo	23
mubyumba	23
icyerekezo	23
utera	23
gupakira	23
joriji	23
basketball.	23
ajugunya	23
wemeye	23
basore,	23
gusenyuka	23
utakwanga	23
nibikoresho	23
icyubahiro.	23
azaguma	23
ibisabwa	23
mba	23
y'ifono	23
Wera	23
h'urubura	23
wambara	23
umubano	23
nibi	23
nyine	23
ziba	23
Twese	23
ukomeye.	23
software	23
maquillage.	23
muzahemberwa	23
Ntazi	23
nkurikije	23
amwita	23
iguye	23
ryabagore	23
ibyuya	23
twagusabye	23
umwarimu	23
nkumuvugizi	23
televiziyo.	23
ndwara	23
gushima	23
hano,	23
Isinzi	23
tutemerewe	23
izasanwa	23
mihango	23
byawe.	23
bakore	23
baratandukanye	23
bino	23
asobanura	23
kumenya.	23
ubwiza	23
tubone	23
kubiganiraho.	23
bike.	23
Azineza	23
ryacu	23
abandi.	23
Asa	23
kamaliza	23
azabihindura.	23
Navuga	23
gushiraho	23
wanditse	23
utaza	23
kimbuza	23
akomeze	23
sinibuka	23
Yagarutse	23
ry’uburinganire	23
guhata	23
rwinshi	23
kumutwe.	23
igerageza	23
White	23
guhumeka	23
rukumbi	23
gutungana	23
irindi	23
kwitondera;	23
Kamaliza	23
mezi	23
utatubwira	23
igoramye	23
kumisha	23
kuryama.	23
nkibi.	23
wohereze	23
kuvugwa	23
abayapani	23
bitwaje	23
barbecue	23
akagira	23
telefone	23
kuvugisha	23
kubiganiraho	23
byagiye	23
Nancy	23
agakoresha	23
ijya	22
igitaramo	22
warangije	22
ishaka	22
umuhinzi	22
zabukuru	22
hazaba	22
abarwayi	22
kariya	22
Yatekereje	22
Jye	22
gafite	22
inzigo	22
Rujugira	22
mumenye	22
ntibizaba	22
Jya	22
arwana	22
guhambira	22
isabukuru	22
desktop	22
Polisi	22
burasirazuba	22
Ba	22
ntameze	22
zituma	22
uzita	22
ingazi	22
zigize	22
kwahe	22
umunyabyaha	22
Shyira	22
babone	22
mugoroba.	22
yemerera	22
yabwiraga	22
ubu,	22
