to	41290
the	36860
I	28757
a	26767
you	19029
of	16050
is	16021
that	15499
he	14543
in	14344
not	14195
and	13932
on	10088
will	9703
with	8632
do	8558
was	8485
have	8325
it	8298
his	8205
be	7963
for	7304
are	7050
A	6588
me	6583
from	6225
this	6120
as	5621
her	5611
want	5462
think	5350
know	5017
but	5011
we	4940
among	4754
she	4599
The	4500
they	4488
don't	4408
man	4392
at	4192
if	3968
He	3961
did	3865
what	3818
by	3674
go	3542
would	3433
like	3341
him	3286
You	3253
can	3159
out	3153
something	2973
about	2945
had	2883
there	2800
who	2749
time	2727
my	2693
so	2655
has	2599
also	2572
people	2487
up	2477
why	2421
your	2387
one	2384
get	2333
don’t	2333
said	2264
home	2254
work	2235
those	2234
all	2232
didn't	2205
woman	2201
Mary	2161
We	2157
can't	2108
make	2102
them	2071
no	2066
I'm	2020
see	1975
It	1968
when	1954
told	1953
just	1947
same	1946
because	1889
these	1881
us	1868
say	1840
tell	1837
could	1835
good	1827
There	1824
their	1790
how	1777
into	1768
should	1726
very	1718
take	1715
second	1623
itself	1621
If	1599
were	1595
help	1589
young	1564
an	1560
only	1554
sure	1524
why?	1493
able	1488
going	1476
it.	1458
come	1451
Do	1435
love	1433
been	1406
doesn't	1397
here	1383
does	1367
much	1348
never	1341
feel	1339
thought	1326
some	1306
shirt	1276
long	1261
wearing	1258
while	1240
or	1232
look	1227
need	1217
way	1203
black	1191
sitting	1160
child	1157
more	1150
may	1145
near	1128
God	1114
back	1099
girl	1094
white	1080
hope	1078
money	1077
next	1046
This	1028
blue	1027
become	1020
give	1010
our	1009
Two	993
They	969
wanted	949
boy	937
none	936
red	932
him.	931
dark	915
How	911
than	903
really	899
things	899
talk	899
many	895
always	894
time.	891
find	890
down	880
other	874
asked	865
mother	863
men	861
water	859
send	856
do.	855
outside	847
two	841
where	840
children	833
ask	829
until	828
dog	823
understand	822
before	821
must	813
now	811
Why	809
soon	800
says	792
wife	780
anything	776
after	774
felt	767
am	761
even	754
throw	753
nothing	753
doing	749
knead	749
What	748
job	747
old	739
went	737
right	736
lot	729
Tom	719
problem	716
believe	715
life	713
little	712
you.	700
first	698
hair	696
enough	690
plant	687
afraid	687
I'll	677
well	671
behind	661
live	657
day	653
speak	649
hard	646
thing	644
place	642
over	636
school	630
son	627
eat	623
Don't	621
standing	619
use	618
buy	617
looks	616
wants	605
In	603
done	603
front	603
new	601
knew	600
father	596
head	589
made	582
When	582
exist	578
heard	577
hear	576
me.	574
last	572
without	568
came	565
it's	563
car	557
She	551
any	550
Nkusi	548
house	547
ever	536
.	530
person	528
every	527
end	526
Paul	524
large	524
family	523
As	522
husband	515
seek	514
according	509
stay	509
best	509
another	507
too	505
used	504
looking	499
today.	497
continue	495
gave	495
women	494
yellow	494
stands	491
pay	490
My	490
desire	489
won't	486
street	481
sake	478
didn’t	478
small	471
search	471
country	464
hunt	463
playing	463
reason	462
such	461
Christ	460
however	459
leave	458
rather	455
put	454
ofg	451
keep	451
plan	449
world	448
group	448
her.	447
show	446
hand	445
saw	444
here.	443
that.	436
someone	436
advice	435
His	434
still	433
together	429
left	427
its	427
possible	425
book	422
bad	422
naked	421
watch	421
might	421
knows	410
try	408
cup	404
each	403
everything	402
let	402
church	400
anyone	399
lost	395
No	394
order	394
idea	390
witness	389
It's	389
cannot	385
around	384
call	383
ther	382
through	380
nearby	380
green	379
which	377
happen	377
receive	375
early	375
care	375
i	373
important	373
tshe	372
baby	371
years	370
words	370
couldn't	369
worship	365
angry	365
return	365
bring	365
Some	363
again.	363
waiting	362
three	362
walk	361
talking	359
difficult	359
better	358
empty	357
up.	356
visit	356
again	355
bricks	355
allow	354
almost	354
That	354
study	350
Ndimbati	350
big	350
play	349
great	348
being	347
word	346
worry	342
brother	340
others	339
whole	339
happy	338
set	338
spend	338
resemble	337
clean	337
act	334
top	334
bicycle	333
change	333
found	333
holding	331
else	331
city	330
often	330
several	330
high	328
John	328
cyilima	328
expect	328
work.	325
dressed	324
given	323
beautiful	323
tried	323
One	322
hands	320
help.	320
own	319
table	316
walks	314
remember	314
got	313
happen.	313
everyone	312
stop	311
you're	309
party	309
face	309
People	308
Since	308
this.	308
road	307
late	307
ball	307
sand	307
exceedingly	306
daughter	306
helmet	306
takes	305
to.	304
friends	304
working	304
meet	304
called	303
since	302
job.	300
food	299
read	298
them.	296
An	295
away	295
probably	294
wrong	294
nearly	292
alone.	291
friend	290
drink	289
Byambo	289
parents	288
And	288
room	286
seems	285
took	283
All	280
allowed	279
known	278
Not	278
name	277
different	276
building	275
Because	275
heart	274
explain	274
you?	273
clothes	271
bag	271
reach	270
though	270
Karasira	270
container	270
there.	269
Tell	269
mine	268
forget	267
quit	267
power	265
off	265
full	264
mind	264
That's	261
wait	261
answer	261
start	260
truth	259
floor	258
finish	258
most	258
between	257
times	257
coat	257
few	256
money.	256
body	254
open	254
Lord	252
tomorrow	252
then	251
Can	251
day.	250
trust	250
Rwanda	250
tree	249
follow	249
learn	249
Is	249
dress	248
lying	247
now.	247
killed	247
Byukusenge	245
air	245
part	245
true	244
week	243
teacher	242
mouth	242
alone	241
Many	241
chair	241
stand	240
jacket	240
something.	239
night	239
photo	238
wouldn't	238
protect	237
mean	237
fast	235
line	235
refused	234
married	234
Are	233
doesn’t	233
makes	233
matter	231
guess	231
So	230
happened	229
school.	228
fall	227
us.	227
train	225
morning.	224
comes	224
bed	222
Three	221
ground	221
ready	220
grass	220
chose	220
purpose	219
eating	219
meeting	219
loves	219
walking	219
lack	219
problems	219
guitar	219
Mary.	218
house.	218
short	218
smell	216
watching	215
did.	214
advice.	214
tells	213
Jesus	213
strong	213
today	212
shooter	212
immediately	211
seeing	211
suppose	211
pass	210
please	210
exit	209
pretty	209
field	209
later	209
sit	209
party.	208
year	208
morning	207
needed	207
unable	207
wish	207
met	206
Mr.	206
agree	206
Kalisa	206
days	205
saying	205
ndimbati	205
homework	205
accept	205
advised	204
goes	203
Did	203
store	203
easy	203
recently	203
enjoy	201
catch	200
boys	200
it?	200
people.	199
rock	199
well.	199
jumps	197
dogs	196
home.	196
girls	195
busy	195
special	194
light	194
wonder	193
close	193
window	193
clear	192
month	192
quickly	191
whenever	191
trying	191
hat	189
go.	189
doctor	189
ones	188
done.	188
longer	188
likely	187
question	187
sleep	186
sun	186
under	186
kind	186
method	185
loved	185
cold	185
ten	185
began	184
himself	184
much.	184
picture	183
seem	183
case	182
wake	182
chance	181
problem.	181
story	181
thin	181
spoke	180
far	180
fact	180
park	180
sign	179
figure	178
English	178
this?	177
door	177
supposed	177
car.	177
sister	176
wall	176
both	176
support	175
hour	175
taking	175
seen	173
lose	173
arrived	172
plays	172
needs	171
succeed	171
earth	171
anet	171
hours	171
wife.	171
Rukara	170
tired	170
letter	170
path	169
shows	169
orange	169
run	169
looked	168
fear	168
waste	168
continued	168
boat	167
learned	167
phone	166
works	166
helps	166
hurt	165
that's	165
river	165
karasira	165
worthy	164
clay	164
way.	164
sorry	163
opportunity	163
all.	163
wrong.	163
Asian	162
faith	162
pants	161
rich	161
gospel	161
baseball	161
likes	160
marry	160
rely	160
cause	160
holds	159
swim	159
trees	159
share	159
game	159
Spirit	159
friends.	159
aid	158
fresh	158
afternoon.	158
suit	157
five	157
shorts	157
happens	157
war	157
kill	156
office	156
mold	156
gives	156
Although	156
choose	155
jeans	155
solve	155
older	154
narrative	154
fight	154
attention	153
written	153
soon.	152
write	152
These	152
above	152
admit	152
bought	152
I’m	152
interested	151
p.m.	151
sick	151
death	151
agreement	151
room.	150
die	150
After	150
Please	150
shop	150
arrive	150
value	149
reading	149
four	149
tall	149
anyhow	149
Simon	148
Chris	148
Even	148
weather	148
brought	148
tennis	147
stood	147
At	146
reasons	146
necessary	146
doubt	145
coming	144
business	144
asks	144
rain	144
say.	144
Her	144
hirwa	144
lives	144
tomorrow.	144
boss	143
righteous	143
point	141
anything.	140
gift	140
plans	140
nice	140
night.	140
know.	139
thinking	139
roof	139
mountain	139
Boston	139
camera	139
fire	139
stupid	139
realized	138
believed	138
attend	138
born	138
news	138
boyfriend	138
dry	137
save	137
kitchen	137
middle	136
win	136
soul	136
woke	136
feet	135
vain	135
Beth	135
fulfilled	135
started	135
sad	134
master	134
For	134
beyond	134
lived	133
sea	133
worried	133
world.	133
here?	133
eyes	133
Here	132
late.	132
questions	132
player	131
means	131
Now	131
side	130
turned	130
lead	129
books	129
deep	129
hospital	129
changed	129
won	129
complete	129
showed	128
sent	128
Just	128
gone	128
possible.	128
so.	127
market	127
number	127
fell	127
God's	127
guy	127
taken	127
To	127
post	127
lake	126
grew	126
students	126
avoid	126
uses	126
instead	126
telling	126
poverty	126
eaten	125
thing.	125
hot	125
leaving	125
wear	125
twice	125
asking	125
pray	125
not.	124
poor	124
Eric	124
living	124
foreign	124
ways	124
paid	124
snow	123
pick	123
good.	123
against	123
things.	123
least	123
Jerusalem	122
especially	122
guarantee	122
thinks	122
fine	122
native	122
precede	122
future	121
gets	121
Little	121
strange	121
prepare	121
relationship	120
happened.	120
bus	119
profit	119
But	119
glasses	119
calm	118
yet	118
United	118
build	118
decent	118
asleep	118
during	118
year.	118
sometimes	117
finished	117
stretch	117
cut	117
out.	117
animals	117
sits	116
restaurant	116
holy	116
carry	116
sell	115
using	115
language	115
hesitate	115
turn	115
It’s	115
food.	115
believers	114
shouldn't	114
flowers	114
text	114
age	114
feeling	114
heaven	113
king	113
rope	113
difficulty	113
accused	113
remain	113
human	113
effort	113
ministry	113
feels	113
making	113
idea.	113
became	112
project	112
begin	112
week.	111
box	111
can’t	111
month.	111
message	111
stopped	111
half	111
drinking	111
move	111
birth	111
God.	111
unless	110
broke	110
test	110
tonight.	109
Everyone	109
realize	109
achieve	109
certain	109
understood	108
it,	108
ability	108
players	108
rules	108
Holy	108
glass	108
adult	108
unexpected	108
do?	107
minute	107
plan.	107
getting	106
Japan	106
Rwandans	106
fun	106
family.	106
appear	106
life.	106
music	106
raise	106
sweater	106
swimming	105
waited	105
plane	105
meeting.	105
sex	105
French	105
peace	104
promise	104
decided	104
sound	104
issue	104
kids	104
bar	104
wrote	103
usually	103
quiet	103
died	103
perfect	103
team	103
giving	103
wisdom	103
law	102
assist	102
carrying	102
below	102
tank	102
bread	102
hit	102
knowing	102
mom	102
crowd	101
homework.	101
watches	101
me,	101
exaggerate	100
suicide.	100
mistake	100
Peter	100
promised	100
climbs	100
health	100
days.	100
Those	99
thirty	99
conversation	99
thoughts	99
courage	99
less	99
police	99
advise	99
rest	99
travel	98
milk	98
haven't	98
real	98
nature	98
listen	98
danger	98
expected	98
running	97
microphone	97
powerful	97
appears	97
gold	97
meal	97
prevent	97
parked	97
toy	97
Let's	97
you'll	96
eat.	96
smiles	96
due	96
covered	96
caused	96
runs	96
already	96
myself	96
surprised	95
belief	95
years.	95
ill,	95
treat	95
coffee	95
lot.	95
fishing	94
meat	94
old.	94
right?	94
hole	94
it’s	94
Kenny	94
be.	94
enemy	94
Church	94
race	94
once	94
strength	94
shopping	93
problems.	93
normal	93
ought	93
yesterday	93
mistakes	93
having	93
company	93
anyone.	92
sturdy	92
unlikely	92
shoes	92
Have	92
studying	92
later.	92
stick	91
obey	91
religion	91
aware	91
rumors	91
Sometimes	91
training	91
Rwandan	91
control	90
returned	90
puts	90
committed	90
accident	90
Don’t	90
develop	90
prior	90
pain	90
Japanese	90
man.	90
burned	89
pool	89
t-shirt	89
legs	89
book.	89
forest	89
ago	89
fence	89
toward	89
careful	89
mirror	89
Men	89
leaves	88
arms	88
hearts	88
King	88
free	88
public	88
example	88
Nothing	88
wine	88
knowledge	88
sees	87
beer	87
agreed	87
grief	87
Something	87
moment	87
answer.	87
computer	87
Four	86
listening	86
grabs	86
importance	86
gathered	86
stupid.	86
TV	85
heaven.	85
drop	85
tries	85
office.	85
foot	85
worry.	85
Only	85
back.	85
weeks	85
speaker	85
he's	85
season	85
expensive	85
spirit	85
abroad	84
student	84
teachings	84
Who	84
flat	84
afraid.	84
Where	84
missing	84
led	83
times.	83
decision	83
happen?	83
teach	83
Long	83
sing	83
bride	83
stayed	83
football	83
filled	83
alive	82
indeed	82
Mary's	82
obviously	82
heal	82
brothers	82
there?	82
hide	82
definitely	82
trouble	82
six	82
station	82
dance	82
heavy	81
child.	81
sat	81
yet.	81
train.	81
tie	81
popular	81
According	81
workers	81
board	81
willing	81
better.	81
paying	81
shoulder	81
afternoon	81
machine	81
place.	81
continues	80
crazy	80
efforts	80
program	80
honest	80
health.	80
garbage	80
caught	80
helped	80
type	80
girlfriend	80
joy	79
rule	79
past	79
fellow	79
Bill	79
English.	79
president	79
age.	79
Does	79
verse	79
I’ll	79
saltines	79
eh?	79
Monday.	79
bottle	79
preparing	79
own.	79
smoking	79
happening	79
walked	79
bags	78
mountains	78
farm	78
imagine	78
dirty	78
away.	78
truck	78
lunch	78
teaching	78
angry.	78
Tokyo	78
friend.	78
action	78
dirt	78
Someone	77
members	77
cross	76
grow	76
Our	76
steps	76
ilk	76
information	76
yourself	76
leader	76
afford	76
university	75
Will	75
New	75
lend	75
picnic	75
unknown	75
shown	75
others.	75
followed	75
sleep.	75
children.	75
air.	75
deal	75
lower	75
upside	75
paper	75
discriminating	75
render	75
Boston?	75
wheelchair	75
elderly	75
pose	74
hospital.	74
miss	74
cost	74
interesting	74
glad	74
date	74
shirts	73
whatever	73
I've	73
delay	73
benefit	73
fish	73
John.	73
area	73
right.	73
throws	73
image	73
rid	73
hearing	73
worked	73
remove	73
based	73
Savior	72
stones	72
bridge	72
riding	72
judge	72
servant	72
birthday	72
confident	72
dead	72
Satan	72
sports	72
appeared	72
lie	72
taught	71
concert	71
earlier	71
step	71
Children	71
exam	71
chairs	71
amount	71
watch.	71
determined	71
drink.	71
following	71
once.	71
disappoint	71
raised	71
word.	71
competition	71
add	71
evening	71
Hopefully	71
exercise	70
weekend.	70
dad	70
hundred	70
while.	70
construction	70
President	70
respect	70
door.	70
medicine	70
disciples	70
Boston.	70
guys	69
Maybe	69
calls	69
talked	69
loan	69
is.	69
uniforms	69
dip	69
movie	69
On	69
noise	69
kingdom	69
minutes	69
section	68
Matthew	68
easier	68
released	68
paint	68
kalisa	68
cry	68
anyway.	68
army.	68
ship	68
Museveni	68
received	68
kiss	68
aisle	68
except	68
harm	68
best.	68
hate	67
serious	67
preach	67
important.	67
general	67
television	67
spread	67
buried	67
precious	67
refuse	67
singing	67
attempt	67
stone	67
relatives	67
heat	67
death.	67
profession	67
seven	67
cloth	67
trip	66
noticed	66
riches	66
culture	66
fun.	66
earth.	66
convince	66
break	66
position	66
terrible	66
impossible	65
Without	65
approach	65
metal	65
commanded	65
hurry	65
sings	65
whom	65
Due	65
Kevin	65
Your	65
twenty	65
outdoor	65
ice	65
regret	65
consider	65
secret	65
irritate	65
repay	65
loss	64
prove	64
failed	64
that?	64
something?	64
cell	64
products	64
commit	64
eye	64
security	64
laugh	64
comfort	64
useful	64
early.	64
TV.	64
intelligence	64
teaches	64
brother.	64
country.	63
French.	63
deny	63
you've	63
Anet	63
doing.	63
fur	63
military	63
ate	63
truly	63
spoken	63
goodbye	63
uncle	63
Kizito	63
waits	63
words.	63
borrow	63
didn't.	63
Nkusi.	63
showing	63
satisfied	63
fired	63
plenty	63
prison	62
attack	62
program.	62
thick	62
was.	62
destroy	62
seat	62
safe	62
command	62
price	62
Saturday.	62
smiling	62
eternal	62
drive	62
blood	62
themselves	62
everything.	62
grocery	62
Government	62
join	62
closer	62
said.	62
George	62
love.	62
bear	62
thout	61
driving	61
onld	61
bank	61
hill	61
chest	61
helping	61
enter	61
wet	61
think.	61
responsibility	61
Probably	61
Kigeme	61
beans	61
whether	61
seemed	61
decide	61
bucket	61
hated	61
nothing.	61
personal	61
do,	61
funny	61
pictures	61
Didn't	61
writing	61
apparently	60
exam.	60
course	60
failed.	60
books.	60
weight.	60
smoke	60
behavior	60
towards	60
Mike	60
Kagame	60
aunt	60
ignore	60
see.	60
cat	60
However	60
Let	60
fromld	60
Five	60
weekend	60
force	59
level	59
songs	59
pressure	59
fulfill	59
laughed	59
me?	59
Mugabe	59
stadium	59
why.	59
kamali	59
Corinth	59
losing	59
thought.	59
smile	59
driver's	59
jumping	58
brings	58
role	58
played	58
apologize	58
beating	58
horse	58
opened	58
island	58
enemies	58
go,	58
causes	58
brick	58
singer	58
difference	58
exactly	58
lord	58
teachers	58
staying	58
measure	57
history	57
pacy	57
proverb	57
yard	57
worshiper	57
choir	57
temple	57
grabbed	57
fix	57
themselves.	57
soil	57
explained	56
forever.	56
poured	56
Yet	56
way,	56
By	56
true.	56
chain	56
speaks	56
cutting	56
request	56
months	56
far.	56
pregnant	56
byukusenge	56
cold.	56
shaved	56
learning	56
With	56
patient	56
motorcycle	56
sky	56
safety	56
?	56
speed	55
reached	55
project.	55
missed	55
languages	55
photos	55
wealth	55
remaining	55
Looks	55
Tom.	55
wondering	55
breath	55
land	55
amazing	55
created	55
ground.	55
2:30	55
surrounded	55
preaching	55
want.	55
party?	55
Christ.	55
Most	54
hell	54
rushed	54
camp	54
ran	54
hopes	54
question.	54
post.	54
lawyer	54
report	54
common	54
fruit	54
end.	54
weight	54
carefully	54
snake	54
else.	54
cook	54
Madonna	54
provide	54
grab	54
him?	54
army	54
foxes	53
Mubera	53
named	53
cooking	53
dangerous	53
spent	53
tongue	53
college	53
amongld	53
habit	53
lied	53
mess	53
accompanied	53
Anyone	53
war.	53
Christian	53
is?	53
blame	53
speech	53
behave	53
care.	53
service	53
bed.	53
won’t	52
ideas	52
animal	52
streets	52
apostle	52
chosen	52
are.	52
sunglasses	52
need.	52
ugly	52
mobile	52
[S]	52
employer	52
Japanese.	52
robe	52
we'll	52
coffee.	52
swim.	52
home?	52
May	52
visible	52
today,	52
anymore.	52
wants.	52
laughing	52
tied	52
mugabo	52
shot	52
john	52
writer	51
cap	51
accepted	51
Mary?	51
added	51
source	51
.I	51
thousand	51
beard	51
summer	51
smoking.	51
Kelly	51
one's	51
evil	51
clan	51
From	51
environment	51
wondered	51
anxious	51
speaking	51
becomes	50
come.	50
sittout	50
hotel	50
miles	50
entered	50
hold	50
piece	50
French,	50
talks	50
time?	50
Whatever	50
raining	50
leave.	50
process	50
one.	50
success	50
doctor.	50
painting	50
artist	50
insist	50
David	50
row	50
say,	50
uncommon	50
doorway	50
feelings	50
recommend	50
fool	49
beginning	49
wakes	49
bad.	49
Gashuhe	49
plastic	49
Words	49
hadn't	49
points	49
Aren't	49
finds	49
Both	49
well-known	49
upset	49
racket	49
youth	49
basketball	49
joined	49
evidence	49
me'm	49
thank	49
mask	49
witnesses	49
parents.	49
saved	49
choice	48
before,	48
caring	48
hour.	48
bones	48
yours	48
forward	48
marriage	48
pocket	48
inherit	48
warn	48
kept	48
serve	48
sittamongg	48
American	48
Instead	48
birds	48
now?	48
putting	48
boyfriend.	48
mentioned	48
shouldn't.	48
wonderful	48
there's	48
hoped	48
yesterday.	48
truth.	48
closed	48
image,	47
shoulders	47
fishing.	47
happiness	47
list	47
mugisha	47
priest	47
address	47
planned	47
shakes	47
changes	47
grill	47
same.	47
left.	47
stage	47
refuses	47
broken	47
wooden	47
prayer	47
places	47
reduce	47
wanting	47
weren't	47
bike	47
mention	47
along	47
ofk	47
signs	47
cars	47
lived.	47
Every	46
built	46
raw	46
mother's	46
sin	46
welcome	46
windows	46
urge	46
feed	46
houses	46
before.	46
held	46
shore	46
like.	46
gifts	46
Americans	46
cleaning	46
regular	46
secret.	46
praise	46
plate	46
government	46
buying	46
Pacific	46
recall	46
forgot	46
Monday	46
argue	46
song	46
wherever	45
sun.	45
color	45
fill	45
mother.	45
arm	45
despite	45
kelly	45
job?	45
available	45
thing?	45
journey.	45
says.	45
cool	45
grace	45
prize	45
crown	45
native.	45
pain.	45
scared	45
speakers	45
much,	45
participating	45
honor	45
low	45
slept	45
enough.	45
together.	45
development	45
growing	45
planning	45
prepares	45
millions	45
accident.	45
Karasira's	45
Look	45
what's	45
bills	45
shadow	45
peace.	44
defeat	44
burns	44
distance	44
power.	44
sittintog	44
couple	44
mistake.	44
village	44
request.	44
forsake	44
trap	44
climb	44
numbers	44
questions.	44
kid	44
drums	44
enjoyed	44
sacrifice	44
surprise	44
righteousness	44
whose	44
voice	44
absence	44
shocked	44
crow	44
know?	44
wasn't	44
Musinga	44
ill	44
students.	44
Son	44
Before	44
asleep.	44
bottom	44
economy	44
resolve	44
studied	43
tying	43
glorify	43
him,	43
Then	43
beg	43
secretary	43
belong	43
States	43
we're	43
penetrate	43
wedding.	43
rest.	43
defeated	43
license	43
dreamed	43
senior	43
about.	43
live.	43
dancing	43
news.	43
lunch.	43
belongs	43
airport	43
year?	43
media	43
tent	43
chapter	43
smart	43
vegetables	43
wicked	43
final	43
too.	43
letters	43
feelings.	43
hand.	43
replace	43
work,	43
shaken	43
Smith	43
(your)	43
time,	42
suffer	42
completely	42
waking	42
throwing	42
smiled	42
(over	42
Father	42
elder	42
interpret	42
discussing	42
fly	42
present	42
passed	42
they're	42
cared	42
evangelistic	42
jesus	42
frustrated	42
invest	42
wished	42
conclusion	42
humble	42
first.	42
dark.	42
trip.	42
cake	42
counsel	42
talk.	42
arrested	42
dictionary	42
unto	42
eyes.	42
hears	42
this,	42
discuss	42
Obviously	42
wshen	42
consequences.	42
associate	42
threatened	42
leaders	42
favorite	42
direction	41
Take	41
...	41
what.	41
garden	41
shut	41
seen)	41
leads	41
discouraged	41
stepping	41
help?	41
cease	41
Christians	41
dream	41
performance	41
enjoying	41
tonight	41
understand.	41
talking.	41
pitch	41
Dad	41
pushed	41
hungry	41
coats	41
period	41
quick	41
weekend?	41
card	41
thfrom	41
organization	41
guard	41
account	41
tomorrow?	41
session	41
water.	41
business.	41
required	41
disease.	41
ordered	41
minds	41
kenny	41
married.	41
increase	41
fighting	41
replaced	40
parts	40
now,	40
goal	40
hall	40
Sometimes,	40
Christmas	40
resurrection	40
blonde	40
practice	40
result	40
crucified	40
However,	40
whisn	40
sense	40
Maria	40
mountain.	40
oppose	40
road.	40
hero	40
Apparently	40
dead.	40
article	40
task.	40
various	40
consequences	40
day,	40
Titus	40
games	40
Rome	40
adults	40
stuff	40
personal,	40
Ruganzu	40
father's	40
rubber	40
Paul's	40
shaking	40
rocky	39
apostles	39
classmates.	39
pure	39
know,	39
beat	39
pulling	39
confused	39
wall.	39
apologized	39
Olivier	39
although	39
opinion	39
suffered	39
man's	39
whern	39
smart,	39
phone.	39
warned	39
drugs	39
hired	39
equipment	39
cruelty	39
rice	39
opens	39
main	39
stronger	39
Keep	39
jump	39
Be	39
herr	39
on.	39
tattoo	39
more.	39
mother?	39
usual	39
sins	38
comforted	38
Couples	38
state	38
copy	38
brave	38
dinner	38
Saul	38
leaning	38
hours.	38
perish	38
quarrel	38
check	38
pull	38
plantn't	38
discussion.	38
kneadn't	38
buys	38
pile	38
grades	38
including	38
confusion	38
bench	38
countries	38
himself.	38
encourage	38
laptop	38
finger	38
crowded	38
kindness	38
blind	38
radio	38
Hirwa	38
house,	38
stomach	38
throne	37
parking	37
shops	37
closely	37
finally	37
arts	37
Gloria	37
carpet	37
Katsumi	37
celebrate	37
iron	37
activity	37
education	37
helmets	37
demanded	37
encouraged	37
alcohol	37
mind.	37
trouble.	37
beautiful.	37
polite	37
thrown	37
jobs	37
classes	37
followers	37
horrible	37
down.	37
disease	37
fallen	37
Thou	37
Claude	37
names.	37
chariot	37
ears	37
rides	37
angel	37
_	37
pond	37
information.	37
moon	37
well,	37
makeup.	37
pack	37
sentences	37
another.	37
shirtless	37
mission	37
Thank	37
names	37
salt	36
winter	36
happy.	36
third	36
Young	36
could,	36
hadn’t	36
pot	36
political	36
kagabo	36
happily	36
falling	36
Bob	36
worship?	36
duty	36
finding	36
single	36
grows	36
remedy	36
happened?	36
innocent	36
clock	36
preached	36
buy.	36
sack	36
temporary	36
bicycles	36
borrowed	36
husband.	36
rainy	36
concrete	36
cloak	36
absolutely	36
language.	36
mental	36
York	36
edit	36
laughs	36
consult	36
golf	36
saddened	36
paul	36
bathing	36
fully	36
reflect	36
hats	36
bat	36
sandals	36
meter	36
Anything	35
eating.	35
damaged	35
gather	35
remained	35
Brian	35
outside.	35
withstand	35
Next	35
badly	35
capo?	35
shall	35
ahead	35
responsibility.	35
T-shirt	35
tea	35
center	35
Kigali	35
sendn't	35
improved	35
First	35
suffering	35
character	35
shaving	35
welcomed	35
team.	35
investigator	35
again?	35
fiancé	35
Being	35
breeder	35
destroyed	35
claim	35
gray	35
citizen	35
French?	35
None	35
depends	35
matter.	35
swimsuit	35
Jewish	35
completing	35
Julie	35
table.	35
class.	35
healed	35
reply	35
companions	35
foreigners	35
America	35
conduct	34
rural	34
Suzuki	34
reports	34
Women	34
actions	34
discourage	34
line.	34
foods	34
knead.	34
cows	34
Mark	34
simple	34
net	34
she's	34
court	34
great.	34
hard.	34
Kivu	34
lady	34
predict	34
dies	34
London	34
owed	34
Of	34
shouted	34
traditional	34
wind	34
sher	34
die.	34
rains	34
silver	34
eat?	34
connected	34
go?	34
Alice	34
prices	34
Spirit.	34
otherwise	34
younger	34
fruits	34
wowitness	34
peer	34
bite	34
scared.	34
basket	34
cow	34
work?	34
beautifull	34
answers	33
in.	33
thfor	33
sort	33
enjoys	33
night,	33
refrain	33
revenge	33
birthday.	33
angels	33
prepared	33
worth	33
Thomas	33
resting	33
enlisted	33
Revlon	33
right-	33
Christ's	33
myself.	33
employee	33
wedding	33
rejoice	33
shade	33
belt	33
reaching	33
constantly	33
reveal	33
secrets	33
writes	33
imprisoned	33
believes	33
crying	33
revealed	33
Crowds	33
sword	33
rocks	33
driven	33
hips	33
sick.	33
upon	33
surprised.	33
homework,	33
football.	33
gravel	33
bird	33
justice	33
queen	33
concerned	33
mountain?	32
delivered	32
respected	32
necklace	32
neighbors	32
despise	32
confirmed	32
sooner	32
key	32
easily.	32
proving	32
eager	32
officially	32
release	32
technology	32
obese.	32
worse	32
clearly	32
punish	32
factor	32
h	32
ferirst	32
shooting	32
colleagues	32
job,	32
branch	32
deserve	32
separated	32
drinks	32
approached	32
flag	32
chain.	32
microscope	32
Excuse	32
independent	32
Chinese	32
requires	32
watched	32
overcome	32
brag	32
shake	32
Sally	32
origin	32
grandfather	32
Giants	32
Looking	32
tool	32
unreasonable	32
modern	32
throw.	32
consent	32
returns	32
identified	32
nimbati	32
thrown't	32
rain.	32
glory	32
arrives	32
separate	32
hair.	32
district	31
mayor	31
standintog	31
telephone	31
nourished	31
thighs	31
risk	31
violent	31
graffiti	31
ring	31
king's	31
forgive	31
intention	31
admitted	31
poses	31
cancer	31
steal	31
river.	31
button	31
contact	31
will.	31
client	31
easy.	31
cement	31
lust	31
cuts	31
Timothy	31
million	31
health,	31
surpass	31
kitchen.	31
promoted.	31
issue.	31
social	31
eats	31
he'll	31
fluent	31
o'clock	31
skateboard	31
neck	31
study.	31
alive.	31
possess	31
sale	31
u	31
lives.	31
apologize.	31
disciples.	31
cycled.	31
Friday.	31
saying.	31
receiving	31
vote.	31
poor.	31
name.	31
improve	31
Tshe	31
bass	30
cultivate	30
college.	30
persuaded	30
father.	30
rent	30
woods	30
says:	30
Get	30
moved	30
club	30
rests	30
wrapped	30
Eventually	30
uniform	30
owner	30
votes	30
Bible	30
Lucky	30
gain	30
production	30
Ephesus	30
Joan,	30
two.	30
staff	30
bikini	30
toys	30
shouldn’t	30
Kamali	30
should.	30
leak	30
opportunities	30
Come	30
sounds	30
lake.	30
mobilizing	30
results	30
grant	30
properly	30
prophecy	30
debate	30
rights	30
satisfactory	30
flight.	30
decision.	30
dollars	30
removed	30
form	30
ticket.	30
faster	30
rich.	30
lecturer.	30
unaware	30
goal.	30
liked	30
expecting	30
inside	30
Kinyarwanda	30
cape	30
Nazareth	30
shame	30
extraordinary	29
eight	29
farmer	29
task	29
S	29
fable	29
raped	29
send.	29
god	29
Tokyo?	29
rear	29
hear.	29
somethamongg	29
research	29
sisters	29
room,	29
thanked	29
out?	29
site	29
experience	29
shine	29
hitting	29
violate	29
Tanganyika	29
drum	29
well-dressed	29
head.	29
attacking	29
women.	29
Had	29
adds	29
screen	29
Prayers	29
Brazilian	29
he’s	29
sleeping	29
hidden	29
infected	29
colors	29
wise	29
Let’s	29
Washington	29
soccer	29
feel.	29
papers	29
bomb	29
bridegroom	29
deceived	29
physicist	29
calmed	29
him;	29
beret	29
explain.	29
ofd	29
from.	29
champions	29
spectators	29
scheduled	29
red-haired	29
isn't	29
eventually	29
length	29
maybe	29
Recently	29
reason.	29
movie.	29
Gasabo	29
swam	29
pasture	29
jeopardize	29
team,	29
benefits	29
climbing	29
wore	29
Savior.	29
hurting	29
release.	29
hates	29
medicine.	28
meters	28
relieved	28
choice.	28
skirt	28
thousands	28
digging	28
potential	28
contrary	28
documents	28
leans	28
terms	28
raising	28
energy	28
middle-aged	28
clothing	28
guide	28
thamongk	28
thirteen	28
lines	28
magazine	28
Nile.	28
untill	28
nowhere	28
motsecond	28
extinction	28
mime	28
solo	28
Brazil	28
lies	28
school?	28
Voice	28
passengers	28
unusual	28
somethintog	28
Frisbee	28
lo	28
behold	28
illness	28
proud	28
barber	28
Him	28
listened	28
unhappy	28
disagree	28
straight	28
soldiers	28
natural	28
beard.	28
own?	28
defend	28
that,	28
treated	28
exist.	28
therefore	28
sinners	28
blood.	28
nearing	28
completion	28
remind	28
size	28
standout	28
Ther	28
lined	28
ofe	28
involved	28
math	28
memories	28
dog.	28
touches	28
best,	28
Once	28
ceremony	28
yourselves	27
related	27
covenant	27
needed.	27
stole	27
council	27
friends?	27
educated	27
sea.	27
Police	27
Rwanda.	27
minister	27
over.	27
ear	27
motitself	27
ignored	27
thery	27
remembering	27
imprisonment	27
huge	27
doctors	27
hotels	27
Mubera.	27
valuable	27
Lang	27
teammate	27
damage	27
teeth	27
circulate	27
hurts	27
scary	27
chief	27
attacks	27
field?	27
bag.	27
stay.	27
reads	27
leg	27
markets	27
angrily	27
Ruhinda	27
hisr	27
wild	27
wohusband	27
is,	27
experiment	27
hanging	27
anyone,	27
progress.	27
would.	27
Today	27
rise	27
States?	27
traveling	27
carries	27
today?	27
explanation	27
striped	27
principle	27
shepherd	27
cars.	27
astray	27
alone?	27
breaking	27
Ever	27
knife	27
commandments.	27
affair	27
gospel.	27
lesson	27
come,	27
sides	27
light.	27
claimed	27
beneath	26
contents	26
structure	26
knees	26
thintok	26
denied	26
years?	26
punished	26
Last	26
demand	26
churches	26
flies	26
fled	26
volcano	26
mind,	26
flying	26
start.	26
mothis	26
Tokyo.	26
company.	26
field.	26
read.	26
election.	26
starting	26
sentence	26
simply	26
region	26
strive	26
teacher.	26
motthose	26
Whites	26
stated	26
tribe	26
rich,	26
Israel	26
ball,	26
corkscrew.	26
change.	26
position.	26
trix	26
Him.	26
Rome.	26
experts	26
Until	26
medication	26
fails	26
license.	26
endure	26
nations.	26
member	26
Nations	26
wearintog	26
unity	26
misunderstanding.	26
website	26
reconciliation	26
chocolate	26
feet.	26
trash	26
case.	26
tables	26
nor	26
measures	26
unripe	26
debts.	26
break.	26
debt	26
,	26
administration	26
parachute	26
comes,	26
appreciated.	26
mothe	26
sold	26
Mary,	26
city.	26
Lord.	26
mad	26
possession	26
beauty	26
turns	25
graduated	25
term	25
classmate	25
actually	25
Day	25
grassy	25
mystery	25
thankful	25
couples	25
pillow	25
Tutsi	25
weak.	25
monday.	25
process.	25
exceed	25
ashamed	25
yourself.	25
rwanda	25
Parents	25
rights.	25
with.	25
opinion.	25
Doctors	25
motare	25
avenge	25
6	25
busy.	25
meal.	25
prayed	25
renewed	25
applicable?	25
Mazimpaka	25
Marry	25
week?	25
blessings	25
movies.	25
over,	25
recently.	25
Jane	25
bandanna	25
sunny	25
impossible.	25
finishing	25
Athens	25
Tom's	25
costumes	25
that’s	25
community	25
encourages	25
ringing,	25
anywhere.	25
African	25
tire	25
hoping	25
pillar	25
income	25
per	25
sip	25
forgiving	25
milk.	25
seeks	25
sibling	25
research.	25
journey	25
worshiping	25
strike	25
gods	25
sons	25
ruin	25
testimony	25
for?	25
soup	25
night?	25
dinner.	25
Gisaka	25
colored	25
Isn't	25
rwema	25
neighborhood	25
backs	25
burning	25
stealing	25
rush	25
expert	25
kissed	25
children,	25
exaggeration	25
entertained	25
boots	25
percent	25
compare	25
Jews	25
freedom	25
push	25
customers	25
across	25
shave,	25
sending	25
-	25
tears	25
me'll	25
newborn	24
eleven	24
invited	24
rewarded	24
anita	24
Luckily	24
desktop	24
new.	24
hang	24
Put	24
space	24
james	24
port	24
threw	24
conceived	24
hunting	24
acquaintances	24
antibiotics	24
viruses.	24
barriers	24
town	24
unfortunately	24
famous.	24
awards	24
morning?	24
whites	24
suits	24
diane	24
Their	24
rising	24
assured	24
today's	24
burdened.	24
professionally	24
cried	24
his.	24
meet.	24
want?	24
feelings,	24
motorcycle?	24
cake.	24
cream	24
skill	24
podium	24
rooms	24
film	24
win.	24
sandals.	24
begun	24
apply	24
tired.	24
hatred	24
redeem	24
snowy	24
Confirm	24
continuing	24
siblings	24
respects	24
cooked	24
boat.	24
software	24
controlling	24
sore	24
john?	24
email	24
page	24
Would	24
HIV	24
here,	24
darcy	24
toddler	24
soft	24
Therre	24
yesterday?	24
capture	24
heaven;	24
declares	24
battle	24
exhausted	24
you,	24
chased	24
charge	24
Today,	24
confirmation	24
box.	24
parable	23
Isaiah	23
thisy	23
envy	23
long.	23
Go	23
match	23
Kabera	23
Burundi	23
physical	23
library	23
cares	23
jewelry	23
instructions.	23
nation	23
Say	23
temper	23
ancient	23
waltz	23
flow	23
Mom	23
Christine	23
burn	23
overlooking	23
Kanjogera	23
goods	23
tend	23
red-clad	23
Fidel	23
unique	23
greatly	23
blessed	23
escape	23
flower	23
publicly	23
mercy	23
species	23
collegue	23
sunset	23
arrest	23
saved.	23
recover	23
photographer	23
fault	23
rush.	23
shout	23
woman's	23
largest	23
wears	23
tickets	23
prosper?	23
could.	23
demands	23
struggle	23
wanted.	23
notice	23
I?	23
stories	23
rivers	23
placed	23
neighbor	23
detractors	23
focus	23
background	23
repaired	23
suicide	23
burden	23
seriously	23
drinking.	23
desk	23
sister.	23
concert.	23
kamaliza	23
confirms	23
discovered	23
equality	23
car?	23
fine.	23
not,	23
camouflage	23
meaning	23
White	23
alert	23
character,	23
art	23
Kamaliza	23
pulls	23
whats	23
mothome	23
disobey	23
barbecue	23
Nancy	23
graduate	23
wood	23
PM	22
injured	22
Word	22
for.	22
accuse	22
prophet	22
score	22
kneadn’t	22
Sunday	22
Rujugira	22
pushes	22
point.	22
rent.	22
drawn	22
chances	22
clock.	22
Redeemer	22
urges	22
manage	22
speak.	22
hot.	22
mouths	22
again,	22
shave	22
elected	22
punishment	22
pleased	22
sonp	22
photograph	22
parade	22
Thursday.	22
shelp	22
standamongg	22
loss.	22
plot	22
poorly.	22
can.	22
mum	22
religious.	22
Cook	22
Science	22
Monitor's	22
bureau.	22
division	22
corner	22
joking	22
soil.	22
discouraged.	22
thinks:	22
ourselves	22
developed	22
handkerchief	22
reflects	22
heavens	22
note	22
plant.	22
rwandan	22
iron,	22
mine?	22
dark,	22
types	22
access	22
sweatshirt	22
rejected	22
Paris	22
describes	22
scientists	22
cure	22
blessing	22
kneels	22
implement	22
skin	22
banks	22
medical	22
read?	22
replied	22
announced	22
wouldn’t	22
victory	22
groom	22
opportunity.	22
glory.	22
specific	22
loud	22
Lucy	22
popcorn	22
object	22
conflict	22
self-sacrifice	22
apple	22
Love	22
effective	22
Mrs.	22
movies	22
Give	22
Anointed	22
Rwabugili.	22
motthese	22
Evelyne	22
issues	22
arrive?	22
ocean	22
thism	22
person's	22
station?	22
Never	22
declared	22
around.	22
arise	22
meaning.	22
Japan.	22
winning	21
surround	21
whisre	21
June	21
them:	21
loving	21
hid	21
honey	21
fish.	21
fisherman	21
author	21
stolen	21
accuses	21
common.	21
Hurry	21
preacher	21
hungry.	21
weather.	21
motorcyclist	21
weary	21
interfere	21
property	21
Follow	21
conversations	21
Jefferson	21
graduating	21
activities	21
stuff?	21
alone,	21
twenties.	21
evening.	21
drawing	21
wipe	21
midnight.	21
society	21
July	21
doctor,	21
fake	21
design	21
World	21
thisre	21
there,	21
Read	21
recovery	21
returned.	21
second.	21
wrong,	21
skills	21
ono	21
'When	21
invite	21
handle	21
evidence?	21
principles.	21
sliding	21
customs	21
Remember	21
Daniel	21
Jack	21
mostly	21
camera.	21
Between	21
skate	21
courtyard	21
Barnabas	21
bicycle.	21
craftsmanship	21
satan	21
anymore	21
glass.	21
solution	21
willy	21
artists	21
silent	21
interest	21
plants	21
ofgs	21
Baseball	21
knocked	21
drunken	21
together?	21
cities,	21
classmates	21
department	21
hammer	21
restaurant.	21
jealous	21
picked	21
fromday.	21
serious.	21
climate	21
drunk	21
oil	21
contained	21
govern	21
maintain	21
ended	21
bush	21
taken?	21
strengthened	21
again!	21
poem	21
South	21
amongday.	21
traditions	21
avatar	21
descended	21
childhood	21
Japan,	21
examine	21
studies	21
fair	21
assure	21
intended	21
Omega	21
summer,	21
Jerusalem.	20
standard	20
border	20
compete	20
lonely	20
Domitra	20
bathroom	20
believing	20
motshe	20
ye	20
can?	20
unintentionally.	20
wearout	20
forgotten	20
granddaughter	20
nights	20
row.	20
toilet	20
dig	20
systems	20
rose	20
biggest	20
burnt	20
salary	20
dictionary.	20
reluctant	20
hardwork	20
severe	20
searching	20
dress.	20
4	20
gathering	20
buckets	20
appreciated	20
attitude	20
mouth.	20
wash	20
does.	20
beaten	20
aim	20
fellowship	20
come;	20
gentle	20
hugging	20
tod	20
wearamongg	20
summer.	20
feels.	20
forbidden	20
environment.	20
known,	20
What’s	20
consists	20
Running	20
bonfils	20
area.	20
circle	20
kids?	20
repeat	20
painkillers	20
anet.	20
somethout	20
prostitute	20
suspects	20
Tshere	20
famous	20
pair	20
Make	20
christian	20
wait.	20
sidewalk	20
cleanse	20
piano	20
successful	20
jumped	20
vote	20
entrance	20
Right	20
solve.	20
hometown	20
weep	20
easily	20
tourist	20
cook.	20
music.	20
meant.	20
times,	20
lucy	20
France	20
Caesar	20
willingness	20
insisted	20
warm	20
opposite	20
them,	20
values	20
ruler	20
finish.	20
Butare	20
doctor's	20
key.	20
Very	20
thief	20
honore	20
criticize	20
heroes	20
doeth	20
keepeth	20
Gatama	20
lessons	20
admits	20
pushing	20
Things	20
homework?	20
child?	20
diseases	20
recovering	20
crime.	20
doll	20
tools	20
issues.	20
meets	20
ritual	20
dentist	20
equal	20
earn?	20
pizza	20
Lacking	20
breathe	20
Workers	20
repair	20
local	20
puppys	20
.....	20
product	20
distorted	20
policy	20
flags	20
progress	20
arrange	20
catches	20
recent	20
besieges	19
vowed	19
headache;	19
contract	19
patients	19
help,	19
knot	19
jean	19
'boss'	19
pockets	19
capacity	19
completed	19
mature	19
abandoned	19
Surprisingly,	19
potential.	19
alarm	19
east	19
refrigerator	19
appeal	19
Call	19
lamp	19
Woman	19
phase	19
gun.	19
cigarette	19
clinic	19
Adam	19
discussed	19
went.	19
mud	19
twins	19
Jews.	19
attitudes	19
sandwiches.	19
pages	19
You're	19
hire	19
heads	19
classes.	19
penis	19
devil	19
com	19
helmet.	19
height	19
companion	19
Another	19
come?	19
clergy	19
worthy.	19
entrance.	19
You've	19
picking	19
sendn’t	19
focused	19
proper	19
plantn’t	19
spring	19
peaceful	19
salt.	19
cart	19
grasp	19
salary.	19
occasionally	19
remembered	19
spy	19
fast.	19
owe	19
express	19
male	19
cop.	19
sink	19
nuclear	19
distinct	19
rescue	19
reproductive	19
eligible	19
issue,	19
horseback	19
pretends	19
thunder	19
lights	19
daughter.	19
entire	19
worker	19
colonial	19
Unable	19
approach.	19
rug	19
Fortunately	19
Nyamvumba	19
tthe	19
open.	19
peace?	19
album	19
Osaka	19
illness.	19
chicken	19
topic	19
taste	19
smooth	19
herself	19
fountain	19
walk.	19
drip	19
blanche	19
soap	19
Yesterday	19
constant	19
Few	19
factory	19
wife's	19
ordinary	19
solved	19
floor.	19
wabout	19
amongo	19
credit	19
create	19
saddest	19
thanksgiving	19
vegetables.	19
ride	18
rarely	18
shaves	18
foretold	18
healing	18
Accept	18
twelve	18
trampoline	18
Museveni's	18
chair.	18
homes	18
therm	18
side.	18
stretched	18
window.	18
restore	18
eaten.	18
past.	18
bouquet	18
Father's	18
provides	18
wrong?	18
young.	18
searched	18
doconr	18
farming	18
fought	18
salvation	18
accepting	18
Egypt	18
calf	18
have.	18
banned	18
represent	18
enabled	18
requirements	18
ex-wife	18
draws	18
gorillas	18
crazy.	18
Nkusi's	18
interests	18
husband's	18
Harvard	18
lover	18
frightening	18
style	18
draw	18
priests	18
something,	18
hiding	18
tshere	18
Yes	18
knowledgeable.	18
countless	18
attracted	18
silenced	18
tragedy	18
cannabis	18
confused.	18
servants	18
reasonable	18
manziwanted	18
blamed	18
kind.	18
armies	18
breakfast.	18
selling	18
masculinity	18
organized	18
amazed	18
scarf	18
manifestation	18
insulted	18
Stop	18
cardboard	18
made.	18
defects.	18
therre	18
ruled	18
entertainment	18
think?	18
swing	18
okay	18
Jehovah	18
Jesus.	18
offer	18
Defeating	18
kindness.	18
lucky	18
Small	18
examined	18
interesting.	18
God,	18
related.	18
tomorrow,	18
Despite	18
text,	18
purchased	18
dispensary	18
Scriptures	18
sport	18
let's	18
concern	18
shape	18
seize	18
trial	18
onday.	18
Australia	18
effects	18
harmony	18
button-down	18
newspaper	18
songs.	18
stairs	18
Uwera	18
evil.	18
ago.	18
marrying	18
ofterested	18
of.	18
assuring	18
visited	18
sing.	18
Barbara	18
permission	18
USA	18
beige	18
yes	18
Thanks	18
patients.	18
suitcase	18
stop.	18
bother	18
gear	18
oneself	18
ear.	18
gas	18
Silas	18
complaining	18
Jonah	18
friends,	18
home,	18
duties	18
offering	18
Mount	18
feeds	18
money,	18
groups	18
High	18
Whether	18
exercises	18
humanity	18
divinity.	18
Ben	17
materials	17
neat	17
wlike	17
Violet	17
Kajubiri	17
Leader	17
Helper!	17
wind.	17
learn.	17
cruel	17
term.	17
Thessalonica	17
pole	17
jokes	17
public.	17
confirm	17
practice.	17
grub	17
touch	17
recipients	17
gospel,	17
Uwimana	17
pretended	17
worshiper.	17
presence	17
survive	17
abdomen	17
upholding	17
listens	17
plainly	17
flip-flops	17
sticks	17
Scientists	17
expressed	17
killing	17
Galatians	17
karate	17
pocket.	17
habits	17
Was	17
investment	17
apply.	17
servants.	17
pointing	17
duty.	17
key?	17
Among	17
sheard	17
swears	17
thirteen.	17
Belgian	17
station.	17
sfromp	17
flowers.	17
heart.	17
thanks?	17
Kellia's	17
goldsmith.	17
diligence	17
Sorry	17
brushed	17
shaved.	17
bullet	17
be,	17
leadership	17
tried.	17
wage	17
disappear	17
refusal	17
fulfillment	17
Joel's	17
courageous	17
positive.	17
I'd	17
Thai	17
outstretched	17
playamongg	17
united	17
Hokkaido	17
population	17
behintod	17
violated	17
tourists	17
protests,	17
journalists.	17
missionary	17
file.	17
handwritten	17
writer.	17
turmoil	17
orderliness	17
mandatory	17
grandmother	17
worst	17
children's	17
future.	17
adjourned	17
get-together	17
jeans.	17
piano.	17
father-in-law	17
truth?	17
socks	17
transport	17
Moses	17
Ukraine	17
responsibility,	17
João	17
denies	17
gold.	17
brake	17
problem,	17
evident	17
return.	17
Its	17
refer	17
washing	17
record	17
starving	17
rises	17
careful.	17
translate	17
explaining	17
Mammie	17
performed	17
announce	17
Frank	17
Damizio’s	17
forever	17
productive	17
Antioch	17
photos?	17
tonight?	17
aren’t	17
collect	17
forgiveness	17
”	17
blackberry	17
vodka	17
trap?	17
eggs	17
sacrifices	17
genocide	17
benediction	17
God’s	17
o'clock.	17
thiery	17
wshere	17
European	17
married,	17
simplicity	17
That’s	17
butterfly	17
healthy	17
Heavn	17
gone.	17
son.	17
men.	17
messengers	17
Benny	17
dresses	17
energy.	17
thrown’t	16
living.	16
gentleman	16
feared	16
snakes	16
facts	16
party,	16
Blessed	16
spot	16
shower	16
Bishop	16
Rugagi	16
funny.	16
shores	16
forty	16
persecuted	16
rujingiro	16
load	16
take?	16
low.	16
level.	16
companies	16
base	16
trade	16
competed	16
slowly.	16
Andrew	16
photographed	16
advocacy	16
wait?	16
survived	16
envolved	16
pictures.	16
prostate.	16
Musigwa	16
rulers	16
games.	16
sugar	16
significant	16
head?	16
chat	16
rooster	16
More	16
Noah	16
contend	16
audience	16
going.	16
Pamela	16
delay.	16
combine	16
fame	16
measured	16
depressed.	16
daily	16
slow	16
nose	16
monitor	16
stools	16
Ananias	16
guest	16
Ken	16
herbal	16
remedy,	16
refugees	16
hasn't	16
recently?	16
Thisre	16
indicates	16
class	16
discover	16
expand	16
necessary.	16
Rwabugiri	16
passing	16
Construction	16
designed	16
March	16
noise.	16
who's	16
everyone.	16
compassion	16
house?	16
floats	16
interest.	16
fifth	16
catching	16
cheating	16
muddy	16
gates	16
international	16
bow	16
You’re	16
feel?	16
playout	16
history.	16
dump	16
East	16
jeremiah	16
neighbour	16
close.	16
strategy	16
services	16
patriotic	16
kneel	16
cyilima's	16
Henry	16
kevin	16
bible	16
tickets.	16
money?	16
custom	16
images	16
studio	16
relax	16
raining,	16
Forgive	16
counter	16
Believers	16
negative	16
forbids	16
Karagwe	16
complaint	16
finalized.	16
ticket	16
Jethro	16
womb	16
Refugees	16
teammates	16
boast	16
He’s	16
back,	16
Getting	16
death;	16
staring	16
Friday	16
dug	16
observe	16
Honestly,	16
curly	16
electing	16
among.	16
officer	16
Ken's	16
poorly	16
black-clad	16
denying	16
lots	16
resurrect	16
unsuccessful.	16
bad,	16
guidance	16
cups	16
changing	16
learns	16
6pm	16
bracelet	16
parents'	16
voluntary	16
excellent	16
tshey	16
hometowns.	16
highly	15
ngomba	15
prison.	15
shallow	15
suffice	15
Mother's	15
liter	15
foreigner,	15
rujindiri	15
gift.	15
text.	15
resignation	15
debts	15
fights	15
whoever	15
gloves	15
spray	15
volcanoes	15
dismissal	15
cycling	15
intoterested	15
bananas.	15
wout	15
ahead.	15
sweet	15
worrying	15
Wshen	15
walls.	15
aluminum	15
mef	15
contradict	15
Auma	15
abide	15
accomplished	15
noon.	15
maroon	15
responsible	15
succeeded,	15
involved.	15
cowboy	15
begins	15
error	15
disappeared	15
person.	15
direction.	15
existed	15
tasted	15
Nyanza	15
master.	15
situation	15
UK	15
gratitude	15
full-time	15
musician.	15
england	15
Nelly	15
soldier	15
Paris.	15
Kenny's	15
free.	15
evolving.	15
goat’s	15
lazy	15
firm	15
mouse	15
prison,	15
invisible	15
mout	15
buy?	15
politics.	15
event	15
manager	15
riots	15
began.	15
everyone's	15
Everything	15
seconds.	15
handed	15
friend?	15
cats	15
anger	15
Kayijuka	15
sadness	15
sustainable.	15
sells	15
endangered	15
Texas	15
eggs?	15
question,	15
balance.	15
surprise,	15
powers	15
bull	15
date.	15
aleady	15
responsibilities	15
worshiped	15
ago,	15
nadine	15
arrival	15
served	15
wthat	15
visit.	15
behout	15
situation.	15
lets	15
bus.	15
leparan	15
volunteers	15
ghosts	15
Yuhi	15
granted	15
system	15
hearers	15
holidays?	15
weapons,	15
singer.	15
either.	15
branches	15
condo.	15
fan.	15
bothered	15
shoot	15
afternoon?	15
earns	15
worshipers	15
mulisa	15
call.	15
inon	15
filming	15
time!	15
successfully	15
did?	15
hislp	15
brethren	15
untie	15
laces	15
Hearing	15
boxes?	15
potatoes	15
confidence	15
chooses	15
through.	15
insulting	15
amongterested	15
ngenzi	15
joints	15
flight	15
buildings	15
unlock	15
truthfully	15
accusers	15
voice.	15
difficulties	15
cassette	15
medecine	15
Such	15
store.	15
whip	15
up?	15
pots	15
prevents	15
run.	15
behamongd	15
testify	15
noon	15
forced	15
mistakes.	15
co-operation	15
quickly.	15
river?	15
condition.	15
volunteered	15
doctrine	15
Indatwa	15
tolerate	15
sudden	15
meat.	15
plantation	15
khaki	15
atheism	15
sponge	15
Based	15
miracles	15
Fires	15
Canada,	15
invent	15
unwilling	15
Rwabugili	15
harder	15
warehouse	15
extent.	15
hundreds	15
effect	15
cent	15
agrees	15
functioning	15
manners	15
early?	15
let’s	15
hotdogs	15
Commissioner	15
(UNHCR)	15
cave	15
overjoyed	15
perplexed	15
location	15
rocking	15
Needless	15
offering.	15
mocks	15
recovers	15
dreaming	15
evening?	15
flesh	14
gasoline	14
Ethienne	14
illegal	14
downstairs	14
veronica	14
locked	14
7	14
horror	14
security.	14
name,	14
drove	14
fat	14
rukara	14
runners	14
sad.	14
diven	14
states	14
graze	14
marley	14
Che	14
Guevara	14
cousin's	14
kingdom.	14
honest,	14
pour	14
Jacob	14
kisses	14
mother-in-law.	14
gained	14
closed.	14
shines	14
perhaps	14
hisr.	14
fatherr	14
dont	14
complain	14
placement	14
brown	14
Can't	14
matters	14
bombs	14
course,	14
cooled	14
stays	14
keeps	14
intimidate	14
Americans,	14
invitation	14
writers	14
cage	14
objects	14
conversion	14
slides	14
prescribed	14
published	14
nations	14
problems,	14
assume	14
interview	14
ma	14
us?	14
Ivrin	14
mornout	14
true?	14
rat	14
sometimes.	14
City	14
Feeling	14
faithful	14
world's	14
Preventing	14
Mukobanya	14
detailed	14
parent	14
prize.	14
balance	14
kinds	14
barnaba	14
yves	14
estimated	14
floating	14
sought	14
ex-husband.	14
play.	14
Axel	14
achievement	14
verb	14
william	14
partner	14
peacefully	14
after.	14
mine,	14
Sitting	14
lottery	14
world?	14
instructions	14
basis?	14
playintog	14
intimidated	14
support,	14
fees	14
co-worker	14
smoking,	14
referee	14
She’s	14
approved	14
else!	14
coat.	14
lay	14
reign	14
Speaking	14
motsame	14
bows	14
uniqueness	14
hills	14
election	14
skepticism	14
See	14
genius	14
feeding.	14
backwards	14
weekend,	14
letting	14
Anet?	14
Katabirora	14
understands	14
clothes.	14
he.	14
expulsion	14
spouse	14
breakfast	14
welearning	14
original	14
delicious	14
stretches	14
enters	14
governed	14
balls	14
admission	14
authority	14
choosed	14
ballerina	14
Whisn	14
trivial	14
"I	14
Tourists	14
fragrance	14
nails	14
desert	14
parachutes	14
foreigner	14
elected.	14
yes.	14
protection	14
restroom	14
organizations	14
achieved	14
figuring	14
collaboration	14
arranged	14
Station	14
shameful	14
buildintog	14
stbying	14
throwesn't	14
daughter's	14
skills.	14
limit	14
kings	14
promising	14
theives	14
land.	14
determine	14
men,	14
indicated	14
hurt.	14
outfit,	14
authorities	14
baseball.	14
story.	14
engineers.	14
comparison	14
checked	14
visiting	14
quarter,	14
minutes.	14
Six	14
book?	14
results.	14
cooks	14
beloved	14
weeks.	14
eye,	14
aboriginal	14
utensils	14
Muhanga	14
Here's	14
proof	14
characterized	14
schedule	14
cooperative.	14
opponents	14
sweets	14
buds.	14
assembly	14
muneza	14
pump	14
hits	14
children?	14
churches.	14
reminded	14
fifty	14
comfortable	14
stbys	14
girls.	13
receives	13
lock	13
address,	13
infrom	13
miss.	13
baby.	13
quarter	13
fields	13
donations	13
shares	13
discussion	13
i'm	13
answered	13
guarded	13
lion	13
pin	13
cans	13
goals	13
indictment	13
victim	13
notified	13
gointog	13
5	13
spreading	13
Norway	13
saving	13
shore;	13
command.	13
count	13
agreement,	13
Mugabo	13
suicidal.	13
don	13
Dog	13
Constitution	13
headache	13
barbwire	13
mainly	13
enable	13
agreeing.	13
heavily	13
ski	13
conveyed	13
Mr	13
forehead	13
shiny	13
Joppa	13
Lydda	13
toe	13
King?	13
instruments	13
cancel	13
shere	13
traout	13
heir	13
scared,	13
assured,	13
orphan	13
denim	13
college?	13
protesting	13
former	13
competing	13
praying	13
Education	13
embracing	13
backyard.	13
happens.	13
heard.	13
traveling.	13
Uneducated	13
Galileans	13
Thessalonians.	13
liar.	13
attended	13
beginners.	13
trials	13
apart	13
edges.	13
custom,	13
Thursday	13
explanation.	13
private	13
users	13
Hutus	13
choices	13
given.	13
crime	13
setting	13
"	13
pen	13
San	13
Francisco	13
rats	13
less.	13
Philip	13
else?	13
hallmarks	13
intelligent	13
mocked	13
agriculture	13
examination	13
shock	13
boasts	13
December.	13
rich?	13
sufferings	13
memorize	13
honest.	13
ruined	13
sout	13
provided	13
abroad.	13
kneadesn't	13
quickly,	13
Journalists	13
idol	13
traffic	13
smallest	13
comforting	13
dealing	13
Carol	13
Yoko	13
skirts	13
describe	13
appearance	13
Celine	13
forth	13
eighteenth.	13
coins	13
arriving	13
national	13
image.	13
there’s	13
Thomson	13
departure	13
keeping	13
otherr	13
flew	13
fruit.	13
items	13
School	13
$	13
wherre	13
tuition.	13
arecause	13
don’t.	13
handsome	13
either	13
t-shirts	13
Unless	13
sirasi	13
jealousy	13
